#################################################################################################
##################################################################################################
(setvar "cmdecho" 0)
(command ".undefine" "help")
(setvar "cmdecho" 1)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;  HELP Lisp РАЗДЕЛИ  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(defun create_dclhelplispR (fn / acadfn)
  (if (null (wcmatch (strcase fn) ".DCL"))
    (setq fn (strcat fn ".DCL"))
  )
;  (if (not (findfile fn))
    ;; create dcl file in same directory as ACAD.pat  
;    (progn
      (setq acadfn (findfile "ACAD.pat")
            fn (vl-string-subst fn "ACAD.pat" acadfn)
            fn (open fn "w")
      )
      (foreach x '(
	  
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	  
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	  
"help1 : dialog { "
"         label = \"                                                              ПОЛЕЗНИ КОМАНДИ\"; "
""
"/////////////////////////////////////////////////////////////"
"///////////////////////// ETP 297 ///////////////////////////"
"/////////////////////////////////////////////////////////////"
"//////////// TEXT ////////////////// "
": column {"
"fixed_width=true;"
"    : row {"
"fixed_width = true;"
"alignment = Left;"
"}"
"}"

"/////////////////////////////////////////////////////////////"
"///////////////////////// команди ///////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////  back  //////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"back\";"
"        label = \"<< НАЗАД към PPS\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
""
"}"
"/////////////////////////////////////////////////////////////"
"//////////////////////// СИТУАЦИЯ  //////////////////////////"
"///////////////////////////////////////////////////////////// "
"    : row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 20;"
"height = 3;"
"fixed_width = true;"
"        key = \"СИТУАЦИЯ\";"
"        label = \"ЗА СИТУАЦИЯ\";"
"	is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - КОМАНДИ СВЪРЗАНИ СЪС СИТУАЦИЯТА\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"//////////////////////// НАПРЕЧНИ  //////////////////////////"
"///////////////////////////////////////////////////////////// "
"    : row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 20;"
"height = 3;"
"fixed_width = true;"
"        key = \"НАПРЕЧНИ\";"
"        label = \"ЗА НАПРЕЧНИ\";"
"	is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - КОМАНДИ СВЪРЗАНИ С НАПРЕЧНИТЕ ПРОФИЛИ\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"//////////////////////// НАДЛЪЖНИ  //////////////////////////"
"///////////////////////////////////////////////////////////// "
"    : row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 20;"
"height = 3;"
"fixed_width = true;"
"        key = \"НАДЛЪЖНИ\";"
"        label = \"ЗА НАДЛЪЖНИ\";"
"	is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - КОМАНДИ СВЪРЗАНИ С НАДЛЪЖНИТЕ ПРОФИЛИ\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"//////////////////////// БЛОКОВЕ   //////////////////////////"
"///////////////////////////////////////////////////////////// "
"    : row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 20;"
"height = 3;"
"fixed_width = true;"
"        key = \"БЛОКОВЕ\";"
"        label = \"ЗА БЛОКОВЕ\";"
"	is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - КОМАНДИ СВЪРЗАНИ С МАНИПУЛАЦИЯ НА БЛОКОВЕ\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"//////////////////////// ЛЕЙАУТИ   //////////////////////////"
"///////////////////////////////////////////////////////////// "
"    : row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 20;"
"height = 3;"
"fixed_width = true;"
"        key = \"ЛЕЙАУТИ\";"
"        label = \"ЗА LAYOUTS\";"
"	is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - КОМАНДИ СВЪРЗАНИ С LAYOUTS\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"////////////////////////   ДРУГИ   //////////////////////////"
"///////////////////////////////////////////////////////////// "
"    : row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 20;"
"height = 3;"
"fixed_width = true;"
"        key = \"ДРУГИ\";"
"        label = \"ДРУГИ\";"
"	is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - ДРУГИ КОМАНДИ \";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
"      }"
"    }"
""
"}"
": row {"
"         label = \"============================================================================\"; "
"}"
"/////////////////////////////////////////////////////////////"
"//////////////////////// CIVIL 3D   //////////////////////////"
"///////////////////////////////////////////////////////////// "
"    : row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 20;"
"height = 3;"
"fixed_width = true;"
"        key = \"СИВИЛ\";"
"        label = \"ЗА CIVIL 3D\";"
"	is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - КОМАНДИ СВЪРЗАНИ СЪС CIVIL 3D\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
"      }"
"    }"
""
"}"
": row {"
"         label = \"============================================================================\"; "
"}"
"/////////////////////////////////////////////////////////////"
"////////////////// Регистри CIVIL 3D  ///////////////////////"
"///////////////////////////////////////////////////////////// "
"    : row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 20;"
"height = 3;"
"fixed_width = true;"
"        key = \"РЕГИСТРИ\";"
"        label = \"ЗА РЕГИСТРИ (CIVIL)\";"
"	is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - КОМАНДИ ЗА ИЗКАРВАНЕ НА РЕГИСТРИ ОТ CIVIL\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"           : boxed_row { "
"             : button {"
"               key = \"cancel\";"
"               label = \"Close\";"
"               is_default = true;"
"               is_cancel = true;"
"		alignment = centered;"
"             } "
"           } "
"      }"
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;			;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	    
                  ) ; endlist
        (princ x fn)
        (write-line "" fn)
      ) ; end foreach
      (close fn)
      (setq acadfn nil)
      t ; return True
;    ) ; end progn
    nil ; return nil
;  ) ; endif
) ; end defun
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
#################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
(defun C:help (/ path plotname n true *error* JHSSHATCH dcl_id go)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; Правене на DCL файла ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(create_dclhelplispR "help1")
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


 (defun *error* (x) (princ "\n*Cancel*"))

 (defun doButton(a)
  (cond
    ((= a 1)(СИТУАЦИЯ))
    ((= a 2)(НАДЛЪЖНИ))
    ((= a 3)(НАПРЕЧНИ))
    ((= a 4)(БЛОКОВЕ))
    ((= a 5)(ЛЕЙАУТИ))
    ((= a 6)(СИВИЛ))
    ((= a 7)(РЕГИСТРИ))
	((= a 8)(ДРУГИ))
	((= a 9)(back))
  )
)

(defun СИТУАЦИЯ ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "СИТУАЦИЯ"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun НАДЛЪЖНИ ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "НАДЛЪЖНИ"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun НАПРЕЧНИ ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "НАПРЕЧНИ"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun БЛОКОВЕ ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "БЛОКОВЕ"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)


(defun ЛЕЙАУТИ ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ЛЕЙАУТИ"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun СИВИЛ ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "СИВИЛ"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun РЕГИСТРИ ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "РЕГИСТРИ"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ДРУГИ ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ДРУГИ"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun back ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "pps"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)
#################################################################################
#################################################################################
#################################################################################
#################################################################################
#################################################################################
#################################################################################
  ;;;--- Load the dcl file
  (setq dcl_id (load_dialog "help1.dcl"))

  ;;;--- Load the dialog definition if it is not already loaded
  (if (not (new_dialog "help1" dcl_id) ) (exit))

  ;;;--- If an action event occurs, do this function
  (action_tile "СИТУАЦИЯ" "(doButton 1)(done_dialog)")
  (action_tile "НАДЛЪЖНИ" "(doButton 2)(done_dialog)")
  (action_tile "НАПРЕЧНИ" "(doButton 3)(done_dialog)")
  (action_tile "БЛОКОВЕ" "(doButton 4)(done_dialog)")
  (action_tile "ЛЕЙАУТИ" "(doButton 5)(done_dialog)")
  (action_tile "СИВИЛ" "(doButton 6)(done_dialog)")
  (action_tile "РЕГИСТРИ" "(doButton 7)(done_dialog)")
  (action_tile "ДРУГИ" "(doButton 8)(done_dialog)")
  (action_tile "back" "(doButton 9)(done_dialog)")
  ;;;--- Display the dialog box
  (start_dialog)
  ;;;--- Unload the dialog box
  (unload_dialog dcl_id)
  ;;;--- Suppress the last echo for a clean exit
  (princ)
(UsedCommand "helpp")
)





#################################################################################################
##################################################################################################
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;  HELP СИТУАЦИЯ     ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(defun create_dclhelplispСИТУАЦИЯ (fn / acadfn)
  (if (null (wcmatch (strcase fn) ".DCL"))
    (setq fn (strcat fn ".DCL"))
  )
;  (if (not (findfile fn))
    ;; create dcl file in same directory as ACAD.pat  
;    (progn
      (setq acadfn (findfile "ACAD.pat")
            fn (vl-string-subst fn "ACAD.pat" acadfn)
            fn (open fn "w")
      )
      (foreach x '(
	  
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	  
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	  
"helpСИТУАЦИЯ : dialog { "
"         label = \"                       HELP КОМАНДИ ЗА СИТУАЦИЯ\"; "
""
"/////////////////////////////////////////////////////////////"
"///////////////////////// ETP 297 ///////////////////////////"
"/////////////////////////////////////////////////////////////"
"//////////// TEXT ////////////////// "
": column {"
"fixed_width=true;"
"    : row {"
"fixed_width = true;"
"alignment = Left;"
"      : text_part {"
"        label = \"            Команда   \";"
"fixed_width=true;"
"      }"
"}"
": row {"
"fixed_width = true;"
"alignment = right;"
"      : text_part {"
"        label = \"   натисни/напиши\";"
"fixed_width=true;"
"      }"
""
"}"
"}"

"/////////////////////////////////////////////////////////////"
"///////////////////////// команди ///////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////  back  //////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"back\";"
"        label = \"<< НАЗАД\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
""
"}"


"/////////////////////////////////////////////////////////////"
"/////////////////////////// km.lsp //////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"km\";"
"        label = \"   km  \";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Копира текста от txt/mtext/блок/атрибут и го пейства в друг txt/mtext/блок/атрибут\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"//////////////////// SLOPES.lsp /////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"slope\";"
"        label = \" slope\";"
"		is_default = false;"
"fixed_width=true;"
"}"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Правене на мустаци на откосите.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
"      }"
"    }"
""
"}"
""
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////   VPOutlineV1-3.lsp       ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"vpo\";"
"        label = \"VPOL\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Прехвърля очертанията на VP в Model-а. С командата VPOA го прави за всички VP едновременно.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       dims                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"dims\";"
"        label = \"dims\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Създава стил дименсии за Ситуация (ако няма), слага го текущ и прави дименсия (aligned)\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       QE                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"qe\";"
"        label = \"QE\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Променяте текста на TEXT, АТРИБУТИ и някои MTEXT в блокове без да влизате в тях\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       QEC                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"qec\";"
"        label = \"QEC\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Променяте цвета на TEXT, АТРИБУТИ и някои MTEXT в блокове без да влизате в тях\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       addtoblock                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"addtoblock\";"
"        label = \"addtoblock\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Вкарва маркирани обекти в маркиран от вас блок\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       ndel                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"ndel\";"
"        label = \"ndel\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Трие обект от блок без да се налага да се влиза в него\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       ncut                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"ncut\";"
"        label = \"ncut\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - CUT-va обект от блок без да се налага да се влиза в него\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       nmove                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"nmove\";"
"        label = \"nmove\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Премества обекти в блокове и XREF без да се налага да влизате в тях. (Внимавайте защото прави save На xref дори да е отворен!)\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       label                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"label\";"
"        label = \"label\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Поставя написан от вас надпис по продължение на Line/Polyline/Curve \";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       DELBLOCKS                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"delblocks\";"
"        label = \"delblocks\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Изтрива избран блок или блокове от файла\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       WW                  ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"ww\";"
"        label = \"ww\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Бързо отбелязване на точки от напречния профил в ситуация, както и нанасяне на кота дъно канавка\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       calc                  ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"calc\";"
"        label = \"calc\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Събира/Изважда две числа (TEXT,MTEXT) и поставя резултата във друг TEXT/MTEXT\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       wf                  ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"wf\";"
"        label = \"wf\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Променя width factor на избран/и текстови обекти\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       wfB                  ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"wfb\";"
"        label = \"wfb\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Променя width factor на текст, който се намира в блок\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       Dit                 ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"DIt\";"
"        label = \"DIt\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Измерва разстоянието между две точки и го записва в избран TEXT или MTEXT\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       BatchETR            ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"etr\";"
"        label = \"BatchETR\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Правите ETRANSМIT на избрани файлове с възможни 3 настройки \";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       ETR            ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"etr1\";"
"        label = \"ETR\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Правите ETRANSМIT на файла с възможни 3 настройки \";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////         PJ               ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"PJ\";"
"        label = \"PJ\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  -  	- Свързва линии/полилинии дори да се застъпват леко или да има малко разстояние между тях\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////         STRELKA           ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"STRELKA\";"
"        label = \"STRELKA\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  -  	- добавяш стрелката с посока на канавката, като маркираш линията на канавката и я поставяш спрямо нея (и на оффсет) където решиш\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////         loadline           ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"loadlineM\";"
"        label = \"LoadLineM\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  -  	- добавя всички аутокадски видове линии във файла\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////         ткм               ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"tkm\";"
"        label = \"TKM\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  -  	- добавя всички типови линии свързани с TKM\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////         MTA               ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"MTA\";"
"        label = \"MTA\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  -  	- прави MapTrim/трие и тримва/ на всички обекти във файла извън посочена граница\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////         Bind-Detach/      ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"Bind-Detach\";"
"        label = \"Bind-Detach\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  -  	- вкарва заредените xref-ове във файла като блокове, а незаредените ги детачва\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////         MTB              ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"MTB\";"
"        label = \"MTB\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  -  	- същото като MTA, но за блокове.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"           : boxed_row { "
"             : button {"
"               key = \"cancel\";"
"               label = \"Close\";"
"               is_default = true;"
"               is_cancel = true;"
"		alignment = centered;"
"             } "
"           } "
"      }"
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;			;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	    
                  ) ; endlist
        (princ x fn)
        (write-line "" fn)
      ) ; end foreach
      (close fn)
      (setq acadfn nil)
      t ; return True
;    ) ; end progn
    nil ; return nil
;  ) ; endif
) ; end defun
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(defun C:СИТУАЦИЯ (/ path plotname n true *error* JHSSHATCH dcl_id go)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; Правене на DCL файла ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(create_dclhelplispСИТУАЦИЯ "helpСИТУАЦИЯ")
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


 (defun *error* (x) (princ "\n*Cancel*"))

 (defun doButton(a)
  (cond
    ((= a 1)(d3))
    ((= a 2)(a3))
    ((= a 3)(km))
    ((= a 4)(pps))
    ((= a 5)(slope))
	((= a 6)(relay))
	((= a 7)(psu))
	((= a 8)(relay))
	((= a 9)(Lsteal))
	((= a 10)(VPOL))
	((= a 11)(otkos))
	((= a 12)(naklon))
	((= a 13)(dimc))
	((= a 14)(dims))
	((= a 15)(ttbhelp))
	((= a 16)(qe))
	((= a 17)(qec))
	((= a 18)(Ln))
	((= a 19)(Lо))
	((= a 20)(addtoblock))
	((= a 21)(ndel))
	((= a 22)(ncut))
	((= a 23)(nmove))
	((= a 24)(label))
	((= a 25)(deblocks))
	((= a 26)(ww))
	((= a 28)(calc))
	((= a 29)(wf))
	((= a 30)(wfb))
	((= a 32)(DIt))
	((= a 33)(etr))
	((= a 34)(etr1))
	((= a 35)(PJ))
	((= a 36)(STRELKA))
	((= a 37)(back))
	((= a 38)(loadlinem))
	((= a 39)(tkm))
	((= a 40)(MTA))
	((= a 41)(Bind-Detach))
	((= a 39)(MTB))
  )
)

(defun d3 ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "d3"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun a3 ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "a3"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun km ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "km"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun pps ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "pps"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun slope ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "slope"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun psu ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "psu"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun relay ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "relay"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun Lsteal ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "LSteal"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun VPOL ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "vpol"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun otkos ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "otkos"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun naklon ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "naklon"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun dimc ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "dimc"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun dims ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "dims"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ttbhelp ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ttbhelp"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun qe ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "qe"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun qec ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "qec"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun Ln ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "Ln"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun Lо ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "LO"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun addtoblock ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "addtoblock"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ndel ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ndel"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ncut ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ncut"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun nmove ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "nmove"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun label ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "label"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun delblocks ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "delblocks"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ww ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ww"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun calc ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "calc"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun wf ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "wf"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun wfb ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "wfb"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun DIt ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "DIt"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun etr ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "BatchETR"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun etr1 ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ETR"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun PJ ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "PJ"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun STRELKA ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "STRELKA"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun back ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "help"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun loadlinem ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "loadlinem"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun tkm ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "tkm"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun MTA ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "MTA"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun Bind-Detach ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "Bind-Detach"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun MTB ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "MTB"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)
#################################################################################
#################################################################################
#################################################################################
#################################################################################
#################################################################################
#################################################################################



  ;;;--- Load the dcl file
  (setq dcl_id (load_dialog "helpСИТУАЦИЯ.dcl"))

  ;;;--- Load the dialog definition if it is not already loaded
  (if (not (new_dialog "helpСИТУАЦИЯ" dcl_id) ) (exit))

  ;;;--- If an action event occurs, do this function
  (action_tile "d3" "(doButton 1)(done_dialog)")
  (action_tile "a3" "(doButton 2)(done_dialog)")
  (action_tile "km" "(doButton 3)(done_dialog)")
  (action_tile "pps" "(doButton 4)(done_dialog)")
  (action_tile "slope" "(doButton 5)(done_dialog)")
  (action_tile "relay" "(doButton 6)(done_dialog)")
  (action_tile "psu" "(doButton 7)(done_dialog)")
  (action_tile "relay" "(doButton 8)(done_dialog)")
  (action_tile "Lsteal" "(doButton 9)(done_dialog)")
  (action_tile "vpo" "(doButton 10)(done_dialog)")
  (action_tile "otkos" "(doButton 11)(done_dialog)")
  (action_tile "naklon" "(doButton 12)(done_dialog)")
  (action_tile "dimc" "(doButton 13)(done_dialog)")
  (action_tile "dims" "(doButton 14)(done_dialog)")
  (action_tile "ttbhelp" "(doButton 15)(done_dialog)")
  (action_tile "qe" "(doButton 16)(done_dialog)")
  (action_tile "qec" "(doButton 17)(done_dialog)")
  (action_tile "Ln" "(doButton 18)(done_dialog)")
  (action_tile "Lо" "(doButton 19)(done_dialog)")
  (action_tile "addtoblock" "(doButton 20)(done_dialog)")
  (action_tile "ndel" "(doButton 21)(done_dialog)")
  (action_tile "ncut" "(doButton 22)(done_dialog)")
  (action_tile "nmove" "(doButton 23)(done_dialog)")
  (action_tile "label" "(doButton 24)(done_dialog)")
  (action_tile "delblocks" "(doButton 25)(done_dialog)")
  (action_tile "ww" "(doButton 26)(done_dialog)")
  (action_tile "calc" "(doButton 28)(done_dialog)")
  (action_tile "wf" "(doButton 29)(done_dialog)")
  (action_tile "wfb" "(doButton 30)(done_dialog)")
  (action_tile "DIt" "(doButton 32)(done_dialog)")
  (action_tile "etr" "(doButton 33)(done_dialog)")
  (action_tile "etr1" "(doButton 34)(done_dialog)")
  (action_tile "PJ" "(doButton 35)(done_dialog)")
  (action_tile "STRELKA" "(doButton 36)(done_dialog)")
  (action_tile "back" "(doButton 37)(done_dialog)")
  (action_tile "loadlinem" "(doButton 38)(done_dialog)")
  (action_tile "tkm" "(doButton 39)(done_dialog)")
  (action_tile "MTA" "(doButton 40)(done_dialog)")
  (action_tile "Bind-Detach" "(doButton 41)(done_dialog)")
  (action_tile "MTB" "(doButton 42)(done_dialog)")
 
  ;;;--- Display the dialog box
  (start_dialog)

  ;;;--- Unload the dialog box
  (unload_dialog dcl_id)

  ;;;--- Suppress the last echo for a clean exit
  (princ)
)



##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;  HELP ЗА НАДЛЪЖНИ     ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(defun create_dclhelplispНАДЛЪЖНИ (fn / acadfn)
  (if (null (wcmatch (strcase fn) ".DCL"))
    (setq fn (strcat fn ".DCL"))
  )
;  (if (not (findfile fn))
    ;; create dcl file in same directory as ACAD.pat  
;    (progn
      (setq acadfn (findfile "ACAD.pat")
            fn (vl-string-subst fn "ACAD.pat" acadfn)
            fn (open fn "w")
      )
      (foreach x '(
	  
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	  
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	  
"helpНАДЛЪЖНИ : dialog { "
"         label = \"                                    HELP КОМАНДИ ЗА НАДЛЪЖНИ\"; "
""
"/////////////////////////////////////////////////////////////"
"///////////////////////// ETP 297 ///////////////////////////"
"/////////////////////////////////////////////////////////////"
"//////////// TEXT ////////////////// "
": column {"
"fixed_width=true;"
"    : row {"
"fixed_width = true;"
"alignment = Left;"
"      : text_part {"
"        label = \"            Команда   \";"
"fixed_width=true;"
"      }"
"}"
": row {"
"fixed_width = true;"
"alignment = right;"
"      : text_part {"
"        label = \"   натисни/напиши\";"
"fixed_width=true;"
"      }"
""
"}"
"}"

"/////////////////////////////////////////////////////////////"
"///////////////////////// команди ///////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////  back  //////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"back\";"
"        label = \"<< НАЗАД\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////// km.lsp //////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"km\";"
"        label = \"   km  \";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Копира текста от txt/mtext/блок/атрибут и го пейства в друг txt/mtext/блок/атрибут\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////   VPOutlineV1-3.lsp       ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"vpo\";"
"        label = \"VPOL\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Прехвърля очертанията на VP в Model-а. С командата VPOA го прави за всички VP едновременно.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       QE                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"qe\";"
"        label = \"QE\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Променяте текста на TEXT, АТРИБУТИ и някои MTEXT в блокове без да влизате в тях\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       QEC                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"qec\";"
"        label = \"QEC\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Променяте цвета на TEXT, АТРИБУТИ и някои MTEXT в блокове без да влизате в тях\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       Ln                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"Ln\";"
"        label = \"Ln\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Чертаете и надписвате линия със зададен от вас наклон в %\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       addtoblock                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"addtoblock\";"
"        label = \"addtoblock\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Вкарва маркирани обекти в маркиран от вас блок\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       ndel                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"ndel\";"
"        label = \"ndel\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Трие обект от блок без да се налага да се влиза в него\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       ncut                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"ncut\";"
"        label = \"ncut\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - CUT-va обект от блок без да се налага да се влиза в него\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       nmove                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"nmove\";"
"        label = \"nmove\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Премества обекти в блокове и XREF без да се налага да влизате в тях. (Внимавайте защото прави save На xref дори да е отворен!)\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       DELBLOCKS                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"delblocks\";"
"        label = \"delblocks\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Изтрива избран блок или блокове от файла\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       calc                  ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"calc\";"
"        label = \"calc\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Събира/Изважда две числа (TEXT,MTEXT) и поставя резултата във друг TEXT/MTEXT\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       wf                  ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"wf\";"
"        label = \"wf\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Променя width factor на избран/и текстови обекти\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       wf                  ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"wfb\";"
"        label = \"wfb\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Променя width factor на текст, който се намира в блок\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       Dit                 ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"DIt\";"
"        label = \"DIt\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Измерва разстоянието между две точки и го записва в избран TEXT или MTEXT\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"           : boxed_row { "
"             : button {"
"               key = \"cancel\";"
"               label = \"Close\";"
"               is_default = true;"
"               is_cancel = true;"
"		alignment = centered;"
"             } "
"           } "
"      }"
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;			;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	    
                  ) ; endlist
        (princ x fn)
        (write-line "" fn)
      ) ; end foreach
      (close fn)
      (setq acadfn nil)
      t ; return True
;    ) ; end progn
    nil ; return nil
;  ) ; endif
) ; end defun
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(defun C:НАДЛЪЖНИ (/ path plotname n true *error* JHSSHATCH dcl_id go)



;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; Правене на DCL файла ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(create_dclhelplispНАДЛЪЖНИ "helpНАДЛЪЖНИ")
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


 (defun *error* (x) (princ "\n*Cancel*"))

 (defun doButton(a)
  (cond
    ((= a 1)(d3))
    ((= a 2)(a3))
    ((= a 3)(km))
    ((= a 4)(pps))
    ((= a 5)(slope))
	((= a 6)(relay))
	((= a 7)(psu))
	((= a 8)(relay))
	((= a 9)(Lsteal))
	((= a 10)(VPOL))
	((= a 11)(otkos))
	((= a 12)(naklon))
	((= a 13)(dimc))
	((= a 14)(dims))
	((= a 15)(ttbhelp))
	((= a 16)(qe))
	((= a 17)(qec))
	((= a 18)(Ln))
	((= a 19)(Lо))
	((= a 20)(addtoblock))
	((= a 21)(ndel))
	((= a 22)(ncut))
	((= a 23)(nmove))
	((= a 24)(label))
	((= a 25)(deblocks))
	((= a 26)(ww))
	((= a 27)(slg))
	((= a 28)(calc))
	((= a 29)(wf))
	((= a 30)(wfb))
	((= a 31)(s2p))
	((= a 32)(s2f))
	((= a 33)(DIt))
	((= a 34)(back))
  )
)

(defun d3 ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "d3"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun a3 ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "a3"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun km ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "km"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun pps ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "pps"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun slope ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "slope"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun psu ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "psu"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun relay ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "relay"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun Lsteal ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "LSteal"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun VPOL ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "vpol"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun otkos ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "otkos"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun naklon ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "naklon"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun dimc ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "dimc"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun dims ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "dims"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ttbhelp ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ttbhelp"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun qe ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "qe"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun qec ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "qec"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun Ln ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "Ln"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun Lо ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "LO"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun addtoblock ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "addtoblock"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ndel ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ndel"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ncut ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ncut"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun nmove ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "nmove"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun label ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "label"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun delblocks ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "delblocks"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ww ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ww"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun slg ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "slg"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun calc ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "calc"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun wf ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "wf"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun wfb ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "wfb"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)


(defun s2p ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "s2p"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun s2f ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "s2f"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun DIt ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "DIt"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)


(defun back ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "help"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)
#################################################################################
#################################################################################
#################################################################################
#################################################################################
#################################################################################
#################################################################################



  ;;;--- Load the dcl file
  (setq dcl_id (load_dialog "helpНАДЛЪЖНИ.dcl"))

  ;;;--- Load the dialog definition if it is not already loaded
  (if (not (new_dialog "helpНАДЛЪЖНИ" dcl_id) ) (exit))

  ;;;--- If an action event occurs, do this function
  (action_tile "d3" "(doButton 1)(done_dialog)")
  (action_tile "a3" "(doButton 2)(done_dialog)")
  (action_tile "km" "(doButton 3)(done_dialog)")
  (action_tile "pps" "(doButton 4)(done_dialog)")
  (action_tile "slope" "(doButton 5)(done_dialog)")
  (action_tile "relay" "(doButton 6)(done_dialog)")
  (action_tile "psu" "(doButton 7)(done_dialog)")
  (action_tile "relay" "(doButton 8)(done_dialog)")
  (action_tile "Lsteal" "(doButton 9)(done_dialog)")
  (action_tile "vpo" "(doButton 10)(done_dialog)")
  (action_tile "otkos" "(doButton 11)(done_dialog)")
  (action_tile "naklon" "(doButton 12)(done_dialog)")
  (action_tile "dimc" "(doButton 13)(done_dialog)")
  (action_tile "dims" "(doButton 14)(done_dialog)")
  (action_tile "ttbhelp" "(doButton 15)(done_dialog)")
  (action_tile "qe" "(doButton 16)(done_dialog)")
  (action_tile "qec" "(doButton 17)(done_dialog)")
  (action_tile "Ln" "(doButton 18)(done_dialog)")
  (action_tile "Lо" "(doButton 19)(done_dialog)")
  (action_tile "addtoblock" "(doButton 20)(done_dialog)")
  (action_tile "ndel" "(doButton 21)(done_dialog)")
  (action_tile "ncut" "(doButton 22)(done_dialog)")
  (action_tile "nmove" "(doButton 23)(done_dialog)")
  (action_tile "label" "(doButton 24)(done_dialog)")
  (action_tile "delblocks" "(doButton 25)(done_dialog)")
  (action_tile "ww" "(doButton 26)(done_dialog)")
  (action_tile "slg" "(doButton 27)(done_dialog)")
  (action_tile "calc" "(doButton 28)(done_dialog)")
  (action_tile "wf" "(doButton 29)(done_dialog)")
  (action_tile "wfb" "(doButton 30)(done_dialog)")
  (action_tile "s2p" "(doButton 31)(done_dialog)")
  (action_tile "s2f" "(doButton 32)(done_dialog)")
  (action_tile "DIt" "(doButton 33)(done_dialog)")
  (action_tile "back" "(doButton 34)(done_dialog)")
  ;;;--- Display the dialog box
  (start_dialog)

  ;;;--- Unload the dialog box
  (unload_dialog dcl_id)

  ;;;--- Suppress the last echo for a clean exit
  (princ)
)
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;  HELP НАПРЕЧНИ     ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(defun create_dclhelplispНАПРЕЧНИ (fn / acadfn)
  (if (null (wcmatch (strcase fn) ".DCL"))
    (setq fn (strcat fn ".DCL"))
  )
;  (if (not (findfile fn))
    ;; create dcl file in same directory as ACAD.pat  
;    (progn
      (setq acadfn (findfile "ACAD.pat")
            fn (vl-string-subst fn "ACAD.pat" acadfn)
            fn (open fn "w")
      )
      (foreach x '(
	  
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	  
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	  
"helpНАПРЕЧНИ : dialog { "
"         label = \"                                   HELP КОМАНДИ ЗА НАПРЕЧНИ\"; "
""
"/////////////////////////////////////////////////////////////"
"///////////////////////// ETP 297 ///////////////////////////"
"/////////////////////////////////////////////////////////////"
"//////////// TEXT ////////////////// "
": column {"
"fixed_width=true;"
"    : row {"
"fixed_width = true;"
"alignment = Left;"
"      : text_part {"
"        label = \"            Команда   \";"
"fixed_width=true;"
"      }"
"}"
": row {"
"fixed_width = true;"
"alignment = right;"
"      : text_part {"
"        label = \"   натисни/напиши\";"
"fixed_width=true;"
"      }"
""
"}"
"}"

"/////////////////////////////////////////////////////////////"
"///////////////////////// команди ///////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////  back  //////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"back\";"
"        label = \"<< НАЗАД\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
""
"}"
"//////////////////////// del3p.lsp //////////////////////////"
"///////////////////////////////////////////////////////////// "
"    : row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"d3\";"
"        label = \"   d3  \";"
"	is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Пускане на ординати в напречните профили.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////// a3.lsp //////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"a3\";"
"        label = \"   a3  \";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Изкарване на оградени площи в напречния профил в таблици.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////// a3a.lsp //////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"a3a\";"
"        label = \"   a3a  \";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Като а3, но изкарва всички площи заедно с км на даден профил наведнъж\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////// km.lsp //////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"km\";"
"        label = \"   km  \";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Копира текста от txt/mtext/блок/атрибут и го пейства в друг txt/mtext/блок/атрибут\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////          Otkosi.lsp       ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"otkos\";"
"        label = \"OTKOS\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Надписва наклона на откоса 1:n\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       naklon.lsp          ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"naklon\";"
"        label = \"NAKLON\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Надписва наклон в %\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       dimc                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"dimc\";"
"        label = \"dimc\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Създава стил дименсии за Напречни профили (ако няма), слага го текущ и прави дименсия (lineal)\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       QE                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"qe\";"
"        label = \"QE\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Променяте текста на TEXT, АТРИБУТИ и някои MTEXT в блокове без да влизате в тях\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       QEC                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"qec\";"
"        label = \"QEC\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Променяте цвета на TEXT, АТРИБУТИ и някои MTEXT в блокове без да влизате в тях\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       Ln                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"Ln\";"
"        label = \"Ln\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Чертаете и надписвате линия със зададен от вас наклон в %\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       Lо                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"Lо\";"
"        label = \"Lо\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Чертаете и надписвате откосна линия със зададен от вас наклон - 1:2 (Y:X)\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       addtoblock                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"addtoblock\";"
"        label = \"addtoblock\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Вкарва маркирани обекти в маркиран от вас блок\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       ndel                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"ndel\";"
"        label = \"ndel\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Трие обект от блок без да се налага да се влиза в него\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       ncut                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"ncut\";"
"        label = \"ncut\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - CUT-va обект от блок без да се налага да се влиза в него\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       nmove                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"nmove\";"
"        label = \"nmove\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Премества обекти в блокове и XREF без да се налага да влизате в тях. (Внимавайте защото прави save На xref дори да е отворен!)\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       DELBLOCKS           ///////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"delblocks\";"
"        label = \"delblocks\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Изтрива избран блок или блокове от файла\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       calc                  ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"calc\";"
"        label = \"calc\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Събира/Изважда две числа (TEXT,MTEXT) и поставя резултата във друг TEXT/MTEXT\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       wf                  ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"wf\";"
"        label = \"wf\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Променя width factor на избран/и текстови обекти\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       wf                  ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"wfb\";"
"        label = \"wfb\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Променя width factor на текст, който се намира в блок\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       LAQ                  ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"laq\";"
"        label = \"LaQ\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Създава слоевете за ограждане на количества. Ако искаш да добавиш нови, направи го във файла Layers.csv в папка TitleBlocks на ЕТП сървъра \";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       Dit                 ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"DIt\";"
"        label = \"DIt\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Измерва разстоянието между две точки и го записва в избран TEXT или MTEXT\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       regATT              ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"regATT\";"
"        label = \"regATT\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Изкарва в екселска таблица стойностите от таблиците с количества в готов вид за пействане в подробната ведомост\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       regATT2             ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"regATT2\";"
"        label = \"regATT2\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Изкарва в екселска таблица стойностите от таблиците с количества, както и сметките, които по принцип се правят в подробната ведомост\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       regATT2             ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"regATTall\";"
"        label = \"regATTall\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Изкарва в екселска таблица стойностите от таблиците с количества + X и Y координати на блока\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////         ATTCH             ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"ATTCH\";"
"        label = \"ATTCH\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Оправя таговете на атрибутската таблица за количества, както са описани във файла Layers.csv\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////         a3all             ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"a3all\";"
"        label = \"a3all\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - автоматично попълва таблиците с количества. Ползва рамките за Layout-и и взима всичко, което попада в тях\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////         D3all             ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"D3all\";"
"        label = \"D3all\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Пуска автоматично Dl3-ки на 1 профил, като се маркира целия прoфил. Слоевете за ОП и ЗОП трявбва да са конкретни.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////         D3all2            ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"D3all2\";"
"        label = \"D3all2\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Пуска автоматично Dl3-ки на n-брой профили, като се мракират рамките за Layout-и . Слоевете за ОП и ЗОП трявбва да са конкретни.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////         D3ro            ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"d3RO\";"
"        label = \"D3RO\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Пуска Dl3-ки на пътни напречни профили, както последно са уточнени\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////            QBZ            ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"QBZ\";"
"        label = \"QBZ\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - автоматично огражда площите на нов баласт и защитен пласт. Може да дава грешки при не-добре затворени контури и по-специфични случаи\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////            QALL            ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"QALL\";"
"        label = \"QH\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - ограждане на всички количества 1 по 1, като изолира нужните слоеве и се огражда като с хетч (ако контура не е затворен или има блокове понякога дава грешки)\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////            QB            ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"QB\";"
"        label = \"QB\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - ограждане на всички количества 1 по 1, като изолира нужните слоеве, маркират се обектите между които да се пусне граница и се огражда с Boundery. По-надеждно е от QH\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"           : boxed_row { "
"             : button {"
"               key = \"cancel\";"
"               label = \"Close\";"
"               is_default = true;"
"               is_cancel = true;"
"		alignment = centered;"
"             } "
"           } "
"      }"
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;			;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	    
                  ) ; endlist
        (princ x fn)
        (write-line "" fn)
      ) ; end foreach
      (close fn)
      (setq acadfn nil)
      t ; return True
;    ) ; end progn
    nil ; return nil
;  ) ; endif
) ; end defun
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(defun C:НАПРЕЧНИ (/ path plotname n true *error* JHSSHATCH dcl_id go)



;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; Правене на DCL файла ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(create_dclhelplispНАПРЕЧНИ "helpНАПРЕЧНИ")
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


 (defun *error* (x) (princ "\n*Cancel*"))

 (defun doButton(a)
  (cond
    ((= a 1)(d3))
    ((= a 2)(a3))
    ((= a 3)(km))
    ((= a 4)(pps))
    ((= a 5)(slope))
	((= a 6)(relay))
	((= a 7)(psu))
	((= a 8)(relay))
	((= a 9)(Lsteal))
	((= a 10)(VPOL))
	((= a 11)(otkos))
	((= a 12)(naklon))
	((= a 13)(dimc))
	((= a 14)(dims))
	((= a 15)(ttbhelp))
	((= a 16)(qe))
	((= a 17)(qec))
	((= a 18)(Ln))
	((= a 19)(Lо))
	((= a 20)(addtoblock))
	((= a 21)(ndel))
	((= a 22)(ncut))
	((= a 23)(nmove))
	((= a 24)(label))
	((= a 25)(deblocks))
	((= a 26)(ww))
	((= a 27)(slg))
	((= a 28)(calc))
	((= a 29)(wf))
	((= a 30)(wfb))
	((= a 31)(s2p))
	((= a 32)(s2f))
	((= a 33)(LAQ))
	((= a 34)(DIt))
	((= a 35)(a3a))
	((= a 36)(regATT))
	((= a 37)(regATT2))
	((= a 38)(ATTCH))
	((= a 39)(a3all))
	((= a 40)(D3all))
	((= a 41)(D3all2))
	((= a 42)(back))
	((= a 43)(regAttAll))
	((= a 44)(d3RO))
	((= a 45)(QBZ))
	((= a 46)(QALL))
	((= a 47)(QB))
  )
)

(defun d3 ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "d3"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun a3 ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "a3"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun km ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "km"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun pps ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "pps"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun slope ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "slope"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun psu ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "psu"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun relay ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "relay"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun Lsteal ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "LSteal"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun VPOL ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "vpol"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun otkos ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "otkos"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun naklon ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "naklon"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun dimc ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "dimc"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun dims ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "dims"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ttbhelp ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ttbhelp"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun qe ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "qe"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun qec ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "qec"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun Ln ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "Ln"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun Lо ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "LO"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun addtoblock ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "addtoblock"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ndel ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ndel"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ncut ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ncut"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun nmove ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "nmove"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun label ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "label"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun delblocks ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "delblocks"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ww ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ww"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun slg ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "slg"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun calc ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "calc"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun wf ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "wf"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun wfb ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "wfb"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)


(defun s2p ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "s2p"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun s2f ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "s2f"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun LAQ ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "LAQ"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun DIt ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "DIt"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun a3a ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "a3a"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun regATT ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "regATT"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun regATT2 ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "regATT2"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ATTCH ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ATTCH"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun a3all ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "a3all"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun D3all ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "D3all"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun D3all2 ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "D3all2"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun back ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "help"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun regAttAll ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "regAttAll"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)


(defun d3RO ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "d3ro"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)


(defun QBZ ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "QBZ"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)


(defun QALL ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "QH"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)



(defun QB ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "QB"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)
#################################################################################
#################################################################################
#################################################################################
#################################################################################
#################################################################################
#################################################################################



  ;;;--- Load the dcl file
  (setq dcl_id (load_dialog "helpНАПРЕЧНИ.dcl"))

  ;;;--- Load the dialog definition if it is not already loaded
  (if (not (new_dialog "helpНАПРЕЧНИ" dcl_id) ) (exit))

  ;;;--- If an action event occurs, do this function
  (action_tile "d3" "(doButton 1)(done_dialog)")
  (action_tile "a3" "(doButton 2)(done_dialog)")
  (action_tile "km" "(doButton 3)(done_dialog)")
  (action_tile "pps" "(doButton 4)(done_dialog)")
  (action_tile "slope" "(doButton 5)(done_dialog)")
  (action_tile "relay" "(doButton 6)(done_dialog)")
  (action_tile "psu" "(doButton 7)(done_dialog)")
  (action_tile "relay" "(doButton 8)(done_dialog)")
  (action_tile "Lsteal" "(doButton 9)(done_dialog)")
  (action_tile "vpo" "(doButton 10)(done_dialog)")
  (action_tile "otkos" "(doButton 11)(done_dialog)")
  (action_tile "naklon" "(doButton 12)(done_dialog)")
  (action_tile "dimc" "(doButton 13)(done_dialog)")
  (action_tile "dims" "(doButton 14)(done_dialog)")
  (action_tile "ttbhelp" "(doButton 15)(done_dialog)")
  (action_tile "qe" "(doButton 16)(done_dialog)")
  (action_tile "qec" "(doButton 17)(done_dialog)")
  (action_tile "Ln" "(doButton 18)(done_dialog)")
  (action_tile "Lо" "(doButton 19)(done_dialog)")
  (action_tile "addtoblock" "(doButton 20)(done_dialog)")
  (action_tile "ndel" "(doButton 21)(done_dialog)")
  (action_tile "ncut" "(doButton 22)(done_dialog)")
  (action_tile "nmove" "(doButton 23)(done_dialog)")
  (action_tile "label" "(doButton 24)(done_dialog)")
  (action_tile "delblocks" "(doButton 25)(done_dialog)")
  (action_tile "ww" "(doButton 26)(done_dialog)")
  (action_tile "slg" "(doButton 27)(done_dialog)")
  (action_tile "calc" "(doButton 28)(done_dialog)")
  (action_tile "wf" "(doButton 29)(done_dialog)")
  (action_tile "wfb" "(doButton 30)(done_dialog)")
  (action_tile "s2p" "(doButton 31)(done_dialog)")
  (action_tile "s2f" "(doButton 32)(done_dialog)")
  (action_tile "LAQ" "(doButton 33)(done_dialog)")
  (action_tile "DIt" "(doButton 34)(done_dialog)")
  (action_tile "a3a" "(doButton 35)(done_dialog)")
  (action_tile "regATT" "(doButton 36)(done_dialog)")
  (action_tile "regATT2" "(doButton 37)(done_dialog)")
  (action_tile "ATTCH" "(doButton 38)(done_dialog)")
  (action_tile "a3all" "(doButton 39)(done_dialog)")
  (action_tile "D3all" "(doButton 40)(done_dialog)")
  (action_tile "D3all2" "(doButton 41)(done_dialog)")
  (action_tile "back" "(doButton 42)(done_dialog)")
  (action_tile "regAttAll" "(doButton 43)(done_dialog)")
  (action_tile "d3RO" "(doButton 44)(done_dialog)")
  (action_tile "QBZ" "(doButton 45)(done_dialog)")
  (action_tile "QALL" "(doButton 46)(done_dialog)")
  (action_tile "QB" "(doButton 47)(done_dialog)")
  ;;;--- Display the dialog box
  (start_dialog)

  ;;;--- Unload the dialog box
  (unload_dialog dcl_id)

  ;;;--- Suppress the last echo for a clean exit
  (princ)
)
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;  HELP БЛОКОВЕ     ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(defun create_dclhelplispБЛОКОВЕ (fn / acadfn)
  (if (null (wcmatch (strcase fn) ".DCL"))
    (setq fn (strcat fn ".DCL"))
  )
;  (if (not (findfile fn))
    ;; create dcl file in same directory as ACAD.pat  
;    (progn
      (setq acadfn (findfile "ACAD.pat")
            fn (vl-string-subst fn "ACAD.pat" acadfn)
            fn (open fn "w")
      )
      (foreach x '(
	  
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	  
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	  
"helpБЛОКОВЕ : dialog { "
"         label = \"                                      HELP КОМАНДИ ЗА БЛОКОВЕ\"; "
""
"/////////////////////////////////////////////////////////////"
"///////////////////////// ETP 297 ///////////////////////////"
"/////////////////////////////////////////////////////////////"
"//////////// TEXT ////////////////// "
": column {"
"fixed_width=true;"
"    : row {"
"fixed_width = true;"
"alignment = Left;"
"      : text_part {"
"        label = \"            Команда   \";"
"fixed_width=true;"
"      }"
"}"
": row {"
"fixed_width = true;"
"alignment = right;"
"      : text_part {"
"        label = \"   натисни/напиши\";"
"fixed_width=true;"
"      }"
""
"}"
"}"

"/////////////////////////////////////////////////////////////"
"///////////////////////// команди ///////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////  back  //////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"back\";"
"        label = \"<< НАЗАД\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////// km.lsp //////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"km\";"
"        label = \"   km  \";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Копира текста от txt/mtext/блок/атрибут и го пейства в друг txt/mtext/блок/атрибут\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       QE                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"qe\";"
"        label = \"QE\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Променяте текста на TEXT, АТРИБУТИ и някои MTEXT в блокове без да влизате в тях\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       QEC                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"qec\";"
"        label = \"QEC\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Променяте цвета на TEXT, АТРИБУТИ и някои MTEXT в блокове без да влизате в тях\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       addtoblock                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"addtoblock\";"
"        label = \"addtoblock\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Вкарва маркирани обекти в маркиран от вас блок\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       ndel                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"ndel\";"
"        label = \"ndel\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Трие обект от блок без да се налага да се влиза в него\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       ncut                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"ncut\";"
"        label = \"ncut\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - CUT-va обект от блок без да се налага да се влиза в него\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       nmove                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"nmove\";"
"        label = \"nmove\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Премества обекти в блокове и XREF без да се налага да влизате в тях. (Внимавайте защото прави save На xref дори да е отворен!)\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       DELBLOCKS                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"delblocks\";"
"        label = \"delblocks\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Изтрива избран блок или блокове от файла\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       wf                  ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"wfb\";"
"        label = \"wfb\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Променя width factor на текст, който се намира в блок\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"           : boxed_row { "
"             : button {"
"               key = \"cancel\";"
"               label = \"Close\";"
"               is_default = true;"
"               is_cancel = true;"
"		alignment = centered;"
"             } "
"           } "
"      }"
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;			;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	    
                  ) ; endlist
        (princ x fn)
        (write-line "" fn)
      ) ; end foreach
      (close fn)
      (setq acadfn nil)
      t ; return True
;    ) ; end progn
    nil ; return nil
;  ) ; endif
) ; end defun
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(defun C:БЛОКОВЕ (/ path plotname n true *error* JHSSHATCH dcl_id go)



;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; Правене на DCL файла ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(create_dclhelplispБЛОКОВЕ "helpБЛОКОВЕ")
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


 (defun *error* (x) (princ "\n*Cancel*"))

 (defun doButton(a)
  (cond
    ((= a 1)(d3))
    ((= a 2)(a3))
    ((= a 3)(km))
    ((= a 4)(pps))
    ((= a 5)(slope))
	((= a 6)(relay))
	((= a 7)(psu))
	((= a 8)(relay))
	((= a 9)(Lsteal))
	((= a 10)(VPOL))
	((= a 11)(otkos))
	((= a 12)(naklon))
	((= a 13)(dimc))
	((= a 14)(dims))
	((= a 15)(ttbhelp))
	((= a 16)(qe))
	((= a 17)(qec))
	((= a 18)(Ln))
	((= a 19)(Lо))
	((= a 20)(addtoblock))
	((= a 21)(ndel))
	((= a 22)(ncut))
	((= a 23)(nmove))
	((= a 24)(label))
	((= a 25)(deblocks))
	((= a 26)(ww))
	((= a 27)(slg))
	((= a 28)(calc))
	((= a 29)(wf))
	((= a 30)(wfb))
	((= a 31)(s2p))
	((= a 32)(s2f))
	((= a 33)(back))
  )
)

(defun d3 ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "d3"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun a3 ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "a3"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun km ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "km"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun pps ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "pps"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun slope ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "slope"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun psu ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "psu"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun relay ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "relay"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun Lsteal ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "LSteal"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun VPOL ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "vpol"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun otkos ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "otkos"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun naklon ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "naklon"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun dimc ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "dimc"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun dims ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "dims"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ttbhelp ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ttbhelp"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun qe ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "qe"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun qec ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "qec"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun Ln ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "Ln"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun Lо ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "LO"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun addtoblock ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "addtoblock"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ndel ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ndel"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ncut ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ncut"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun nmove ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "nmove"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun label ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "label"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun delblocks ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "delblocks"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ww ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ww"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun slg ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "slg"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun calc ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "calc"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun wf ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "wf"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun wfb ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "wfb"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)


(defun s2p ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "s2p"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun s2f ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "s2f"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)


(defun back ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "help"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)
#################################################################################
#################################################################################
#################################################################################
#################################################################################
#################################################################################
#################################################################################



  ;;;--- Load the dcl file
  (setq dcl_id (load_dialog "helpБЛОКОВЕ.dcl"))

  ;;;--- Load the dialog definition if it is not already loaded
  (if (not (new_dialog "helpБЛОКОВЕ" dcl_id) ) (exit))

  ;;;--- If an action event occurs, do this function
  (action_tile "d3" "(doButton 1)(done_dialog)")
  (action_tile "a3" "(doButton 2)(done_dialog)")
  (action_tile "km" "(doButton 3)(done_dialog)")
  (action_tile "pps" "(doButton 4)(done_dialog)")
  (action_tile "slope" "(doButton 5)(done_dialog)")
  (action_tile "relay" "(doButton 6)(done_dialog)")
  (action_tile "psu" "(doButton 7)(done_dialog)")
  (action_tile "relay" "(doButton 8)(done_dialog)")
  (action_tile "Lsteal" "(doButton 9)(done_dialog)")
  (action_tile "vpo" "(doButton 10)(done_dialog)")
  (action_tile "otkos" "(doButton 11)(done_dialog)")
  (action_tile "naklon" "(doButton 12)(done_dialog)")
  (action_tile "dimc" "(doButton 13)(done_dialog)")
  (action_tile "dims" "(doButton 14)(done_dialog)")
  (action_tile "ttbhelp" "(doButton 15)(done_dialog)")
  (action_tile "qe" "(doButton 16)(done_dialog)")
  (action_tile "qec" "(doButton 17)(done_dialog)")
  (action_tile "Ln" "(doButton 18)(done_dialog)")
  (action_tile "Lо" "(doButton 19)(done_dialog)")
  (action_tile "addtoblock" "(doButton 20)(done_dialog)")
  (action_tile "ndel" "(doButton 21)(done_dialog)")
  (action_tile "ncut" "(doButton 22)(done_dialog)")
  (action_tile "nmove" "(doButton 23)(done_dialog)")
  (action_tile "label" "(doButton 24)(done_dialog)")
  (action_tile "delblocks" "(doButton 25)(done_dialog)")
  (action_tile "ww" "(doButton 26)(done_dialog)")
  (action_tile "slg" "(doButton 27)(done_dialog)")
  (action_tile "calc" "(doButton 28)(done_dialog)")
  (action_tile "wf" "(doButton 29)(done_dialog)")
  (action_tile "wfb" "(doButton 30)(done_dialog)")
  (action_tile "s2p" "(doButton 31)(done_dialog)")
  (action_tile "s2f" "(doButton 32)(done_dialog)")
  (action_tile "back" "(doButton 33)(done_dialog)")
  ;;;--- Display the dialog box
  (start_dialog)

  ;;;--- Unload the dialog box
  (unload_dialog dcl_id)

  ;;;--- Suppress the last echo for a clean exit
  (princ)
)


##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
#################################################################################################
##################################################################################################
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;  HELP ЛЕЙАУТИ  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(defun create_dclhelplispЛЕЙАУТИ (fn / acadfn)
  (if (null (wcmatch (strcase fn) ".DCL"))
    (setq fn (strcat fn ".DCL"))
  )
;  (if (not (findfile fn))
    ;; create dcl file in same directory as ACAD.pat  
;    (progn
      (setq acadfn (findfile "ACAD.pat")
            fn (vl-string-subst fn "ACAD.pat" acadfn)
            fn (open fn "w")
      )
      (foreach x '(
	  
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	  
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	  
"helpЛЕЙАУТИ : dialog { "
"         label = \"                                     HELP КОМАНДИ ЗА ЛЕЙАУТИ\"; "
""
"/////////////////////////////////////////////////////////////"
"///////////////////////// ETP 297 ///////////////////////////"
"/////////////////////////////////////////////////////////////"
"//////////// TEXT ////////////////// "
": column {"
"fixed_width=true;"
"    : row {"
"fixed_width = true;"
"alignment = Left;"
"      : text_part {"
"        label = \"            Команда   \";"
"fixed_width=true;"
"      }"
"}"
": row {"
"fixed_width = true;"
"alignment = right;"
"      : text_part {"
"        label = \"   натисни/напиши\";"
"fixed_width=true;"
"      }"
""
"}"
"}"

"/////////////////////////////////////////////////////////////"
"///////////////////////// команди ///////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////  back  //////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"back\";"
"        label = \"<< НАЗАД\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////    DWG prop  //////////////////////////"
"/////////////////////////////////////////////////////////////"
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"prop\";"
"        label = \"  prop  \";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Промяна на dwg custom properties, като дата на ревизия.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////    DWG prop  //////////////////////////"
"/////////////////////////////////////////////////////////////"
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"DATA\";"
"        label = \"  DATA  \";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Сменяте датата на ревизията (ако е направена с fields в dwgproperties).\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"///////////////////////   Подписи   /////////////////////////"
"/////////////////////////////////////////////////////////////"
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"podpisi\";"
"        label = \"  podpisi  \";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - С ТАЗИ КОМАНДА ИЗБИРАШ ПОДПИС НА ПРОЕКТАНТ КОЙТО ДА ВМЪКНЕШ В АНТЕТКАТА.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
": text_part {				"
"     label = \"                                                                       (ако проектанта го няма свържи се за да бъде добавен)\";"
;"fixed_width = true;"
"   }"
"/////////////////////////////////////////////////////////////"
"////////////////   insert fields   //////////////////////////"
"/////////////////////////////////////////////////////////////"
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"fields\";"
"        label = \"  fields  \";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Вкарва динаични fields като име на файл, дата на ревизия, ревизия и др.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////   PageSetups CAB 07.LSP   ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"psu\";"
"        label = \"  psu  \";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Добавя Imported Page Setup на избрани или всички Layouts.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////   Layout-NameCH.lsp       ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"relay\";"
"        label = \"RElay \";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Преименува Layout-ите с номерация от 1 до N.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////   LayoutsTransfer.lsp       ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"Lsteal\";"
"        label = \"Lsteal\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Взимане на Layout-и от друг файл.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////   VPOutlineV1-3.lsp       ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"vpo\";"
"        label = \"VPOL\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Прехвърля очертанията на VP в Model-а. С командата VPOA го прави за всички VP едновременно.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       ttbelp                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"ttbhelp\";"
"        label = \"TTBhelp\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - отваря хелп файла, в който е обяснено всичко за TitleBlock-овете\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       ttb                 ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"ttb\";"
"        label = \"TTB\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - вкарва избран от теб вече създаден за дадения обект TitleBlock\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       ttb                 ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"ttbu\";"
"        label = \"TTBU\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - ъпдейтва в отворения файл всичко във вкарания TitleBlock, което не е специфично за всяка фирма или за всяка част\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       tabDSort            ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"TabSort\";"
"        label = \"TabSort\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - манипулация на лейаутите - Сортиране/Местене/Триене/Слагане на prefix/ \";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       copyVp              ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"copyVp\";"
"        label = \"copyVp\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - копира горните лейаути на надлъжния профил при долните /когато са направени чрез MAPWSPACE/ \";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       copy to Layout     ////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"c2l\";"
"        label = \"c2l\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - копира избран от вас обект/обекти в избрани от вас лейаути във файла \";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       copy to all Layouts ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"c2al\";"
"        label = \"c2al\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - копира избран от вас обект/обекти във всички лейаути във файла \";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       select RWC          ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"selectRWC\";"
"        label = \"selectRWC\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - маркира последователно по Y рамките на напречните профили, за да може да се направят Layout-и с MAPWSPACE \";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"           : boxed_row { "
"             : button {"
"               key = \"cancel\";"
"               label = \"Close\";"
"               is_default = true;"
"               is_cancel = true;"
"		alignment = centered;"
"             } "
"           } "
"      }"
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;			;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	    
                  ) ; endlist
        (princ x fn)
        (write-line "" fn)
      ) ; end foreach
      (close fn)
      (setq acadfn nil)
      t ; return True
;    ) ; end progn
    nil ; return nil
;  ) ; endif
) ; end defun
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(defun C:ЛЕЙАУТИ (/ path plotname n true *error* JHSSHATCH dcl_id go)



;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; Правене на DCL файла ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(create_dclhelplispЛЕЙАУТИ "helpЛЕЙАУТИ")
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


 (defun *error* (x) (princ "\n*Cancel*"))

 (defun doButton(a)
  (cond
    ((= a 1)(d3))
    ((= a 2)(a3))
    ((= a 3)(km))
    ((= a 4)(pps))
    ((= a 5)(slope))
	((= a 6)(relay))
	((= a 7)(psu))
	((= a 8)(relay))
	((= a 9)(Lsteal))
	((= a 10)(VPOL))
	((= a 11)(otkos))
	((= a 12)(naklon))
	((= a 13)(dimc))
	((= a 14)(dims))
	((= a 15)(ttbhelp))
	((= a 16)(qe))
	((= a 17)(qec))
	((= a 18)(Ln))
	((= a 19)(Lо))
	((= a 20)(addtoblock))
	((= a 21)(ndel))
	((= a 22)(ncut))
	((= a 23)(nmove))
	((= a 24)(label))
	((= a 25)(deblocks))
	((= a 26)(ww))
	((= a 27)(slg))
	((= a 28)(calc))
	((= a 29)(wf))
	((= a 30)(wfb))
	((= a 31)(s2p))
	((= a 32)(s2f))
	((= a 33)(ttb))
	((= a 34)(ttbu))
	((= a 35)(TabSort))
	((= a 36)(prop))
	((= a 37)(podpisi))
	((= a 38)(fields))
	((= a 39)(DATA))
	((= a 40)(copyVp))	
	((= a 41)(c2l))
	((= a 42)(c2al))
	((= a 43)(back))
	((= a 44)(selectRWC))
  )
)

(defun d3 ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "d3"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun a3 ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "a3"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun km ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "km"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun pps ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "pps"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun slope ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "slope"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun psu ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "psu"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun relay ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "relay"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun Lsteal ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "LSteal"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun VPOL ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "vpol"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun otkos ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "otkos"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun naklon ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "naklon"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun dimc ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "dimc"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun dims ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "dims"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ttbhelp ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ttbhelp"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun qe ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "qe"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun qec ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "qec"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun Ln ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "Ln"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun Lо ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "LO"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun addtoblock ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "addtoblock"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ndel ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ndel"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ncut ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ncut"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun nmove ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "nmove"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun label ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "label"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun delblocks ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "delblocks"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ww ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ww"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun slg ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "slg"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun calc ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "calc"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun wf ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "wf"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun wfb ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "wfb"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)


(defun s2p ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "s2p"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun s2f ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "s2f"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ttb ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ttb"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ttbu ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ttbu"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun TabSort ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "TabSort"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun prop ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "prop"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun podpisi ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "podpisi"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun fields ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "fields"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun DATA ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "DATA"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)


(defun copyVp ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "copyVp"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun c2l ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "c2l"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun c2al ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "c2al"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)


(defun back ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "help"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)


(defun selectRWC ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "selectRWC"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)
#################################################################################
#################################################################################
#################################################################################
#################################################################################
#################################################################################
#################################################################################



  ;;;--- Load the dcl file
  (setq dcl_id (load_dialog "helpЛЕЙАУТИ.dcl"))

  ;;;--- Load the dialog definition if it is not already loaded
  (if (not (new_dialog "helpЛЕЙАУТИ" dcl_id) ) (exit))

  ;;;--- If an action event occurs, do this function
  (action_tile "d3" "(doButton 1)(done_dialog)")
  (action_tile "a3" "(doButton 2)(done_dialog)")
  (action_tile "km" "(doButton 3)(done_dialog)")
  (action_tile "pps" "(doButton 4)(done_dialog)")
  (action_tile "slope" "(doButton 5)(done_dialog)")
  (action_tile "relay" "(doButton 6)(done_dialog)")
  (action_tile "psu" "(doButton 7)(done_dialog)")
  (action_tile "relay" "(doButton 8)(done_dialog)")
  (action_tile "Lsteal" "(doButton 9)(done_dialog)")
  (action_tile "vpo" "(doButton 10)(done_dialog)")
  (action_tile "otkos" "(doButton 11)(done_dialog)")
  (action_tile "naklon" "(doButton 12)(done_dialog)")
  (action_tile "dimc" "(doButton 13)(done_dialog)")
  (action_tile "dims" "(doButton 14)(done_dialog)")
  (action_tile "ttbhelp" "(doButton 15)(done_dialog)")
  (action_tile "qe" "(doButton 16)(done_dialog)")
  (action_tile "qec" "(doButton 17)(done_dialog)")
  (action_tile "Ln" "(doButton 18)(done_dialog)")
  (action_tile "Lо" "(doButton 19)(done_dialog)")
  (action_tile "addtoblock" "(doButton 20)(done_dialog)")
  (action_tile "ndel" "(doButton 21)(done_dialog)")
  (action_tile "ncut" "(doButton 22)(done_dialog)")
  (action_tile "nmove" "(doButton 23)(done_dialog)")
  (action_tile "label" "(doButton 24)(done_dialog)")
  (action_tile "delblocks" "(doButton 25)(done_dialog)")
  (action_tile "ww" "(doButton 26)(done_dialog)")
  (action_tile "slg" "(doButton 27)(done_dialog)")
  (action_tile "calc" "(doButton 28)(done_dialog)")
  (action_tile "wf" "(doButton 29)(done_dialog)")
  (action_tile "wfb" "(doButton 30)(done_dialog)")
  (action_tile "s2p" "(doButton 31)(done_dialog)")
  (action_tile "s2f" "(doButton 32)(done_dialog)")
  (action_tile "ttb" "(doButton 33)(done_dialog)")
  (action_tile "ttbu" "(doButton 34)(done_dialog)")
  (action_tile "TabSort" "(doButton 35)(done_dialog)")
  (action_tile "prop" "(doButton 36)(done_dialog)")
  (action_tile "podpisi" "(doButton 37)(done_dialog)")
  (action_tile "fields" "(doButton 38)(done_dialog)")
  (action_tile "DATA" "(doButton 39)(done_dialog)")
  (action_tile "copyVp" "(doButton 40)(done_dialog)")
  (action_tile "c2l" "(doButton 41)(done_dialog)")
  (action_tile "c2al" "(doButton 42)(done_dialog)")
  (action_tile "back" "(doButton 43)(done_dialog)")
  (action_tile "selectRWC" "(doButton 44)(done_dialog)")
  ;;;--- Display the dialog box
  (start_dialog)

  ;;;--- Unload the dialog box
  (unload_dialog dcl_id)

  ;;;--- Suppress the last echo for a clean exit
  (princ)
)


##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
#################################################################################################
##################################################################################################
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;  HELP ДРУГИ  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(defun create_dclhelplispДРУГИ (fn / acadfn)
  (if (null (wcmatch (strcase fn) ".DCL"))
    (setq fn (strcat fn ".DCL"))
  )
;  (if (not (findfile fn))
    ;; create dcl file in same directory as ACAD.pat  
;    (progn
      (setq acadfn (findfile "ACAD.pat")
            fn (vl-string-subst fn "ACAD.pat" acadfn)
            fn (open fn "w")
      )
      (foreach x '(
	  
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	  
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	  
"helpДРУГИ : dialog { "
"         label = \"                                     HELP КОМАНДИ ЗА ДРУГИ\"; "
""
"/////////////////////////////////////////////////////////////"
"///////////////////////// ETP 297 ///////////////////////////"
"/////////////////////////////////////////////////////////////"
"//////////// TEXT ////////////////// "
": column {"
"fixed_width=true;"
"    : row {"
"fixed_width = true;"
"alignment = Left;"
"      : text_part {"
"        label = \"            Команда   \";"
"fixed_width=true;"
"      }"
"}"
": row {"
"fixed_width = true;"
"alignment = right;"
"      : text_part {"
"        label = \"   натисни/напиши\";"
"fixed_width=true;"
"      }"
""
"}"
"}"

"/////////////////////////////////////////////////////////////"
"///////////////////////// команди ///////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////  back  //////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"back\";"
"        label = \"<< НАЗАД\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////          ETR              ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"ETR\";"
"        label = \"        ETR        \";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Прави eTransmit на отворения файл, като ти дава 3 опции.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       batchEtr            ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"BATCHETR\";"
"        label = \"BATCH ETR\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Прави eTransmit на избрани от теб файлове (не пипай преди да е завършило).\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////         batchPDF          ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"BATCHPDF\";"
"        label = \"BATCH PDF\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Прави PDF-и на избрани от теб файлове като пита за всеки един дали искаш подписи и къде да го запази.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////         batchPDF2          ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"BATCHPDF2\";"
"        label = \"BATCH PDF2\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Прави PDF-и на избрани от теб файлове като заси подписи в слаой Signature и сейва PDF във папката, в която е файла.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////           getv            ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"getv\";"
"        label = \"       GetV        \";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Показва с коя версия на аутокад е save-нат файла.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////        getversions        ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"getversions\";"
"        label = \"GetVersions\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Показва с коя версия на аутокад е save-нат избран от вас файл.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////          meters           ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"meters\";"
"        label = \"   METERS   \";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Прави DWGUNITS в метри. Когато имате проблем с копирането с бейспоинт и импортването на блокове и xref.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////          ATTSYNC          ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"BS\";"
"        label = \"         BS         \";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Ъпдейтва блокове с атрибути.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////          showlLayers      ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"SHOWLAYERS\";"
"        label = \"showLayers\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Изчертава линии и имената на всички Layer-и, които има във файла.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////          kmAll            ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"kmAll\";"
"        label = \"      kmAll       \";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - При нови изкарани от CIVIL пресечки в надлъжен и ситуация надписва километража, а за дренаж надписва кота.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////          kmDel            ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"kmDel\";"
"        label = \"     kmDel      \";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Работи като km само, че ако текста, който се копира е в цвят 40 го трие.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////          template         ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"template\";"
"        label = \"   template   \";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Отваря папката в която се намират темплейт файловете за ACAD,CIVIL и за правене на лейаути\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////          LayerChange      ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"LayerChange\";"
"        label = \"LayerChange\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Променя описаните във файла (Layers - change Names.csv) в актуалните слоеве.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////          regAttAll        ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"regAttAll\";"
"        label = \"regAttAll\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Изкарва всички атрибути заедно с координатите на блока\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////           pcoord          ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"pcoord\";"
"        label = \"pcoord\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - В аутокад изкарваш във файл координати на посочени от теб точки, като също ги именуваш една по една\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////           RTL             ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"rtl\";"
"        label = \"RTL\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - върти TEXT и MTEXT спрямо линия или полилиния\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"           : boxed_row { "
"             : button {"
"               key = \"cancel\";"
"               label = \"Close\";"
"               is_default = true;"
"               is_cancel = true;"
"		alignment = centered;"
"             } "
"           } "
"      }"
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;			;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	    
                  ) ; endlist
        (princ x fn)
        (write-line "" fn)
      ) ; end foreach
      (close fn)
      (setq acadfn nil)
      t ; return True
;    ) ; end progn
    nil ; return nil
;  ) ; endif
) ; end defun
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(defun C:ДРУГИ (/ path plotname n true *error* JHSSHATCH dcl_id go)



;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; Правене на DCL файла ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(create_dclhelplispДРУГИ "helpДРУГИ")
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


 (defun *error* (x) (princ "\n*Cancel*"))

 (defun doButton(a)
  (cond
    ((= a 1)(d3))
    ((= a 2)(a3))
    ((= a 3)(km))
    ((= a 4)(pps))
    ((= a 5)(slope))
	((= a 6)(relay))
	((= a 7)(psu))
	((= a 8)(relay))
	((= a 9)(Lsteal))
	((= a 10)(VPOL))
	((= a 11)(otkos))
	((= a 12)(naklon))
	((= a 13)(dimc))
	((= a 14)(dims))
	((= a 15)(ttbhelp))
	((= a 16)(qe))
	((= a 17)(qec))
	((= a 18)(Ln))
	((= a 19)(Lо))
	((= a 20)(addtoblock))
	((= a 21)(ndel))
	((= a 22)(ncut))
	((= a 23)(nmove))
	((= a 24)(label))
	((= a 25)(deblocks))
	((= a 26)(ww))
	((= a 27)(slg))
	((= a 28)(calc))
	((= a 29)(wf))
	((= a 30)(wfb))
	((= a 31)(s2p))
	((= a 32)(s2f))
	((= a 33)(ETR))
	((= a 34)(BATCHETR))
	((= a 35)(BATCHPDF))
	((= a 36)(getv))
	((= a 37)(getversions))
	((= a 38)(meters))
	((= a 39)(BS))
	((= a 40)(showLayers))
	((= a 41)(kmAll))
	((= a 42)(kmDel))
	((= a 43)(template))
	((= a 44)(BATCHPDF2))
	((= a 45)(LayerChange))
	((= a 46)(regAttAll))
	((= a 47)(back))
	((= a 48)(pcoord))
	((= a 49)(rtl))
  )
)

(defun d3 ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "d3"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun a3 ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "a3"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun km ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "km"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun pps ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "pps"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun slope ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "slope"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun psu ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "psu"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun relay ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "relay"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun Lsteal ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "LSteal"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun VPOL ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "vpol"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun otkos ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "otkos"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun naklon ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "naklon"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun dimc ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "dimc"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun dims ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "dims"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ttbhelp ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ttbhelp"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun qe ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "qe"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun qec ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "qec"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun Ln ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "Ln"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun Lо ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "LO"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun addtoblock ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "addtoblock"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ndel ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ndel"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ncut ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ncut"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun nmove ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "nmove"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun label ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "label"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun delblocks ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "delblocks"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ww ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ww"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun slg ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "slg"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun calc ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "calc"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun wf ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "wf"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun wfb ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "wfb"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)


(defun s2p ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "s2p"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun s2f ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "s2f"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun s2f ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "s2f"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ETR ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ETR"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun BATCHETR ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "BATCHETR"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun BATCHPDF ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "BATCHPDF"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun getv ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "getv"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun getversions ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "getversions"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun meters ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "meters"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun BS ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "BS"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun SHOWLAYERS ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "SHOWLAYERS"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun kmAll ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "kmAll"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun kmDel ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "kmDel"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun template ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "template"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun BATCHPDF2 ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "BATCHPDF2"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun LayerChange ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "LayerChange"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun regAttAll ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "regattall"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun back ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "help"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)


(defun pcoord ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "pcoord"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun rtl ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "RTL"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)
#################################################################################
#################################################################################
#################################################################################
#################################################################################
#################################################################################
#################################################################################



  ;;;--- Load the dcl file
  (setq dcl_id (load_dialog "helpДРУГИ.dcl"))

  ;;;--- Load the dialog definition if it is not already loaded
  (if (not (new_dialog "helpДРУГИ" dcl_id) ) (exit))

  ;;;--- If an action event occurs, do this function
  (action_tile "d3" "(doButton 1)(done_dialog)")
  (action_tile "a3" "(doButton 2)(done_dialog)")
  (action_tile "km" "(doButton 3)(done_dialog)")
  (action_tile "pps" "(doButton 4)(done_dialog)")
  (action_tile "slope" "(doButton 5)(done_dialog)")
  (action_tile "relay" "(doButton 6)(done_dialog)")
  (action_tile "psu" "(doButton 7)(done_dialog)")
  (action_tile "relay" "(doButton 8)(done_dialog)")
  (action_tile "Lsteal" "(doButton 9)(done_dialog)")
  (action_tile "vpo" "(doButton 10)(done_dialog)")
  (action_tile "otkos" "(doButton 11)(done_dialog)")
  (action_tile "naklon" "(doButton 12)(done_dialog)")
  (action_tile "dimc" "(doButton 13)(done_dialog)")
  (action_tile "dims" "(doButton 14)(done_dialog)")
  (action_tile "ttbhelp" "(doButton 15)(done_dialog)")
  (action_tile "qe" "(doButton 16)(done_dialog)")
  (action_tile "qec" "(doButton 17)(done_dialog)")
  (action_tile "Ln" "(doButton 18)(done_dialog)")
  (action_tile "Lо" "(doButton 19)(done_dialog)")
  (action_tile "addtoblock" "(doButton 20)(done_dialog)")
  (action_tile "ndel" "(doButton 21)(done_dialog)")
  (action_tile "ncut" "(doButton 22)(done_dialog)")
  (action_tile "nmove" "(doButton 23)(done_dialog)")
  (action_tile "label" "(doButton 24)(done_dialog)")
  (action_tile "delblocks" "(doButton 25)(done_dialog)")
  (action_tile "ww" "(doButton 26)(done_dialog)")
  (action_tile "slg" "(doButton 27)(done_dialog)")
  (action_tile "calc" "(doButton 28)(done_dialog)")
  (action_tile "wf" "(doButton 29)(done_dialog)")
  (action_tile "wfb" "(doButton 30)(done_dialog)")
  (action_tile "s2p" "(doButton 31)(done_dialog)")
  (action_tile "s2f" "(doButton 32)(done_dialog)")
  (action_tile "ETR" "(doButton 33)(done_dialog)")
  (action_tile "BATCHETR" "(doButton 34)(done_dialog)")
  (action_tile "BATCHPDF" "(doButton 35)(done_dialog)")
  (action_tile "getv" "(doButton 36)(done_dialog)")
  (action_tile "getversions" "(doButton 37)(done_dialog)")
  (action_tile "meters" "(doButton 38)(done_dialog)")
  (action_tile "BS" "(doButton 39)(done_dialog)")
  (action_tile "SHOWLAYERS" "(doButton 40)(done_dialog)")
  (action_tile "kmAll" "(doButton 41)(done_dialog)")
  (action_tile "kmDel" "(doButton 42)(done_dialog)")
  (action_tile "template" "(doButton 43)(done_dialog)")
  (action_tile "BATCHPDF2" "(doButton 44)(done_dialog)")
  (action_tile "LayerChange" "(doButton 45)(done_dialog)")
  (action_tile "regAttAll" "(doButton 46)(done_dialog)")
  (action_tile "back" "(doButton 47)(done_dialog)")
  (action_tile "pcoord" "(doButton 48)(done_dialog)")
  (action_tile "RTL" "(doButton 49)(done_dialog)")
  ;;;--- Display the dialog box
  (start_dialog)

  ;;;--- Unload the dialog box
  (unload_dialog dcl_id)

  ;;;--- Suppress the last echo for a clean exit
  (princ)
)


##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
#################################################################################################
##################################################################################################

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;  HELP СИВИЛ     :;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(defun create_dclhelplispСИВИЛ (fn / acadfn)
  (if (null (wcmatch (strcase fn) ".DCL"))
    (setq fn (strcat fn ".DCL"))
  )
;  (if (not (findfile fn))
    ;; create dcl file in same directory as ACAD.pat  
;    (progn
      (setq acadfn (findfile "ACAD.pat")
            fn (vl-string-subst fn "ACAD.pat" acadfn)
            fn (open fn "w")
      )
      (foreach x '(
	  
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	  
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	  
"helpСИВИЛ : dialog { "
"         label = \"	HELP КОМАНДИ ЗА СИВИЛ\"; "
""
"/////////////////////////////////////////////////////////////"
"///////////////////////// ETP 297 ///////////////////////////"
"/////////////////////////////////////////////////////////////"
"//////////// TEXT ////////////////// "
": column {"
"fixed_width=true;"
"    : row {"
"fixed_width = true;"
"alignment = Left;"
"      : text_part {"
"        label = \"            Команда   \";"
"fixed_width=true;"
"      }"
"}"
": row {"
"fixed_width = true;"
"alignment = right;"
"      : text_part {"
"        label = \"   натисни/напиши\";"
"fixed_width=true;"
"      }"
""
"}"
"}"

"/////////////////////////////////////////////////////////////"
"///////////////////////// команди ///////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////  back  //////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"back\";"
"        label = \"<< НАЗАД\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       slg                  ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"slg\";"
"        label = \"slg\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Правене на предварително зададени SampleLine Groups\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       s2p                  ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"s2p\";"
"        label = \"S2P\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Прави от маркирана SampleLine полилиния, като я вкарва във слоя на SampleLine\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       s2f                  ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"s2f\";"
"        label = \"S2F\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Прави Feature линии на всички SampleLines, или на маркирани. Имената и стиловете са предварително зададени във файла SampleLineGroups.csv\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       flkm                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"flkm\";"
"        label = \"FLkm\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - преименува FL с новият КМ, ако е прекиломертирано или FL са със стари имена\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////        bExp                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"bExp\";"
"        label = \"bExp\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - изкарва mtext/записва във файл: име на атрибут, километраж, кота гл.р., офсет и координати на маркирани блокове\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////        bExp2                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"bExp2\";"
"        label = \"bExp2\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - изкарва mtext/записва във файл: име на атрибут, километраж, офсет и координати на маркирани блокове ( не е нужен надлъжен)\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////        pExp                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"pExp\";"
"        label = \"pExp\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - изкарва mtext/записва във файл: име на точка (въвежда се от теб), километраж, кота гл.р., офсет и координати на точки избрани от теб с мишката\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////        regV                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"regV\";"
"        label = \"regV\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Изкарва регистър в ПРОФИЛ във файл в същата папка. Маркираш алаймънт и избираш Нивелетата за която да се изкара регистъра.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////        regH                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"regH\";"
"        label = \"regH\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Изкарва регистър в ПЛАН във файл в същата папка. Маркираш алаймънт.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////        regC                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"regC\";"
"        label = \"regC\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Изкарва КООРДИНАТЕН регистър във файл в същата папка. Маркираш алаймънт, нивелета, разстояни м/у точките, както и допълнителни точки като начало стрелка.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////        regS                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"regS\";"
"        label = \"regS\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Изкарва регистър на СРЕЛКИТЕ във файл в същата папка. Маркираш стрелките (трябва да са динамничните блокове от ППС), алаймънт и нивелета.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////        kmATT              ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"kmATT\";"
"        label = \"kmATT\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Километрира атрибутски блок спрямо (Incert Point) на блока - трябва да маркираш блоковете, Alignment-а и да напишеш таг-а на атрибута за km.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////         GRR               ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"GRR\";"
"        label = \"GRR\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Прави BrakeLines и Boundery от сивилски точки за направата на повърхнина на същ. гл. релса - маркира се оста, на която искаме да направим Surface\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////         GRR2              ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"GRR2\";"
"        label = \"GRR2\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Като GRR само, че тук се маркират самите точки и когато имаме големи криви трябва да се прави на части, защото при голямо закръгление дава грешки - да се коригира Bounderyto\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////         cPExp              ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"cPExp\";"
"        label = \"cPExp\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Изкарва регистър на реперите от сивилски точки. Маркира се алаймънт и всички сивилски точки\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"           : boxed_row { "
"             : button {"
"               key = \"cancel\";"
"               label = \"Close\";"
"               is_default = true;"
"               is_cancel = true;"
"		alignment = centered;"
"             } "
"           } "
"      }"
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;			;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	    
                  ) ; endlist
        (princ x fn)
        (write-line "" fn)
      ) ; end foreach
      (close fn)
      (setq acadfn nil)
      t ; return True
;    ) ; end progn
    nil ; return nil
;  ) ; endif
) ; end defun
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(defun C:СИВИЛ (/ path plotname n true *error* JHSSHATCH dcl_id go)



;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; Правене на DCL файла ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(create_dclhelplispСИВИЛ "helpСИВИЛ")
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


 (defun *error* (x) (princ "\n*Cancel*"))

 (defun doButton(a)
  (cond
    ((= a 1)(d3))
    ((= a 2)(a3))
    ((= a 3)(km))
    ((= a 4)(pps))
    ((= a 5)(slope))
	((= a 6)(relay))
	((= a 7)(psu))
	((= a 8)(relay))
	((= a 9)(Lsteal))
	((= a 10)(VPOL))
	((= a 11)(otkos))
	((= a 12)(naklon))
	((= a 13)(dimc))
	((= a 14)(dims))
	((= a 15)(ttbhelp))
	((= a 16)(qe))
	((= a 17)(qec))
	((= a 18)(Ln))
	((= a 19)(Lо))
	((= a 20)(addtoblock))
	((= a 21)(ndel))
	((= a 22)(ncut))
	((= a 23)(nmove))
	((= a 24)(label))
	((= a 25)(deblocks))
	((= a 26)(ww))
	((= a 27)(slg))
	((= a 28)(calc))
	((= a 29)(wf))
	((= a 30)(wfb))
	((= a 31)(s2p))
	((= a 32)(s2f))
	((= a 33)(flkm))
	((= a 34)(bExp))
	((= a 35)(pExp))
	((= a 36)(regV))
	((= a 37)(regH))
	((= a 38)(regC))
	((= a 39)(regS))
	((= a 40)(kmATT))
	((= a 41)(GRR))
	((= a 42)(GRR2))
	((= a 43)(back))
	((= a 44)(bExp2))
	((= a 45)(cPExp))
  )
)

(defun d3 ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "d3"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun a3 ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "a3"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun km ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "km"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun pps ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "pps"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun slope ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "slope"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun psu ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "psu"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun relay ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "relay"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun Lsteal ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "LSteal"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun VPOL ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "vpol"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun otkos ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "otkos"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun naklon ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "naklon"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun dimc ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "dimc"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun dims ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "dims"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ttbhelp ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ttbhelp"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun qe ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "qe"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun qec ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "qec"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun Ln ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "Ln"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun Lо ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "LO"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun addtoblock ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "addtoblock"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ndel ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ndel"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ncut ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ncut"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun nmove ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "nmove"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun label ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "label"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun delblocks ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "delblocks"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ww ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ww"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun slg ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "slg"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun calc ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "calc"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun wf ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "wf"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun wfb ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "wfb"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)


(defun s2p ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "s2p"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun s2f ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "s2f"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun flkm ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "flkm"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun bExp ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "bExp"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun pExp ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "pExp"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun regV ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "regV"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun regH ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "regH"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun regC ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "regC"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun regS ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "regS"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun kmATT ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "kmATT"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun GRR ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "GRR"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun GRR2 ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "GRR2"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun back ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "help"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun bExp2 ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "bExp2"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)


(defun cPExp ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "cPExp"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)
#################################################################################
#################################################################################
#################################################################################
#################################################################################
#################################################################################
#################################################################################



  ;;;--- Load the dcl file
  (setq dcl_id (load_dialog "helpСИВИЛ.dcl"))

  ;;;--- Load the dialog definition if it is not already loaded
  (if (not (new_dialog "helpСИВИЛ" dcl_id) ) (exit))

  ;;;--- If an action event occurs, do this function
  (action_tile "d3" "(doButton 1)(done_dialog)")
  (action_tile "a3" "(doButton 2)(done_dialog)")
  (action_tile "km" "(doButton 3)(done_dialog)")
  (action_tile "pps" "(doButton 4)(done_dialog)")
  (action_tile "slope" "(doButton 5)(done_dialog)")
  (action_tile "relay" "(doButton 6)(done_dialog)")
  (action_tile "psu" "(doButton 7)(done_dialog)")
  (action_tile "relay" "(doButton 8)(done_dialog)")
  (action_tile "Lsteal" "(doButton 9)(done_dialog)")
  (action_tile "vpo" "(doButton 10)(done_dialog)")
  (action_tile "otkos" "(doButton 11)(done_dialog)")
  (action_tile "naklon" "(doButton 12)(done_dialog)")
  (action_tile "dimc" "(doButton 13)(done_dialog)")
  (action_tile "dims" "(doButton 14)(done_dialog)")
  (action_tile "ttbhelp" "(doButton 15)(done_dialog)")
  (action_tile "qe" "(doButton 16)(done_dialog)")
  (action_tile "qec" "(doButton 17)(done_dialog)")
  (action_tile "Ln" "(doButton 18)(done_dialog)")
  (action_tile "Lо" "(doButton 19)(done_dialog)")
  (action_tile "addtoblock" "(doButton 20)(done_dialog)")
  (action_tile "ndel" "(doButton 21)(done_dialog)")
  (action_tile "ncut" "(doButton 22)(done_dialog)")
  (action_tile "nmove" "(doButton 23)(done_dialog)")
  (action_tile "label" "(doButton 24)(done_dialog)")
  (action_tile "delblocks" "(doButton 25)(done_dialog)")
  (action_tile "ww" "(doButton 26)(done_dialog)")
  (action_tile "slg" "(doButton 27)(done_dialog)")
  (action_tile "calc" "(doButton 28)(done_dialog)")
  (action_tile "wf" "(doButton 29)(done_dialog)")
  (action_tile "wfb" "(doButton 30)(done_dialog)")
  (action_tile "s2p" "(doButton 31)(done_dialog)")
  (action_tile "s2f" "(doButton 32)(done_dialog)")
  (action_tile "flkm" "(doButton 33)(done_dialog)")
  (action_tile "bExp" "(doButton 34)(done_dialog)")
  (action_tile "pExp" "(doButton 35)(done_dialog)")
  (action_tile "regV" "(doButton 36)(done_dialog)")
  (action_tile "regH" "(doButton 37)(done_dialog)")
  (action_tile "regC" "(doButton 38)(done_dialog)")
  (action_tile "regS" "(doButton 39)(done_dialog)")
  (action_tile "kmATT" "(doButton 40)(done_dialog)")
  (action_tile "GRR" "(doButton 41)(done_dialog)")
  (action_tile "GRR2" "(doButton 42)(done_dialog)")
  (action_tile "back" "(doButton 43)(done_dialog)")
  (action_tile "bExp2" "(doButton 44)(done_dialog)")
  (action_tile "cPExp" "(doButton 45)(done_dialog)")
  ;;;--- Display the dialog box
  (start_dialog)

  ;;;--- Unload the dialog box
  (unload_dialog dcl_id)

  ;;;--- Suppress the last echo for a clean exit
  (princ)
)
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
##################################################################################################
#################################################################################################
##################################################################################################
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;  HELP РЕГИСТРИ     ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(defun create_dclhelplispРЕГИСТРИ (fn / acadfn)
  (if (null (wcmatch (strcase fn) ".DCL"))
    (setq fn (strcat fn ".DCL"))
  )
;  (if (not (findfile fn))
    ;; create dcl file in same directory as ACAD.pat  
;    (progn
      (setq acadfn (findfile "ACAD.pat")
            fn (vl-string-subst fn "ACAD.pat" acadfn)
            fn (open fn "w")
      )
      (foreach x '(
	  
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	  
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	  
"helpРЕГИСТРИ : dialog { "
"         label = \"	HELP КОМАНДИ ЗА РЕГИСТРИ ОТ СИВИЛ\"; "
""

"/////////////////////////////////////////////////////////////"
"///////////////////////////  back  //////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"back\";"
"        label = \"<< НАЗАД\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////        bExp                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"bExp\";"
"        label = \"bExp\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - изкарва mtext/записва във файл: име на атрибут, километраж, кота гл.р., офсет и координати на маркирани блокове\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////        bExp                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"pExp\";"
"        label = \"pExp\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - изкарва mtext/записва във файл: име на точка (въвежда се от теб), километраж, кота гл.р., офсет и координати на точки избрани от теб с мишката\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////        regV                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"regV\";"
"        label = \"regV\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Изкарва регистър в ПРОФИЛ във файл в същата папка. Маркираш алаймънт и избираш Нивелетата за която да се изкара регистъра.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////        regH                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"regH\";"
"        label = \"regH\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Изкарва регистър в ПЛАН във файл в същата папка. Маркираш алаймънт.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////        regC                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"regC\";"
"        label = \"regC\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Изкарва КООРДИНАТЕН регистър във файл в същата папка. Маркираш алаймънт, нивелета, разстояни м/у точките, както и допълнителни точки като начало стрелка.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////        regS                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"regS\";"
"        label = \"regS\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Изкарва регистър на СРЕЛКИТЕ във файл в същата папка. Маркираш стрелките (трябва да са динамничните блокове от ППС), алаймънт и нивелета.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////        regS2                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"regS2\";"
"        label = \"regS2\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Като regS, само че изважда стрелки и по отклонение (за ИННО) - подредбата е старата: четни - нечетни\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////        regHro              ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"regHro\";"
"        label = \"regHro\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Изкарва регистър в ПЛАН на ПЪТ във файл в същата папка.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////        regVro              ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"regVro\";"
"        label = \"regVro\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Изкарва регистър в ПРОФИЛ на ПЪТ във файл в същата папка.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////        regCro              ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"regCro\";"
"        label = \"regCro\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Изкарва КООРДИНАТЕН регистър на ПЪТ във файл в същата папка.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////         cPExp              ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"cPExp\";"
"        label = \"cPExp\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Изкарва регистър на реперите от сивилски точки. Маркира се алаймънт и всички сивилски точки\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"           : boxed_row { "
"             : button {"
"               key = \"cancel\";"
"               label = \"Close\";"
"               is_default = true;"
"               is_cancel = true;"
"		alignment = centered;"
"             } "
"           } "
"      }"
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;			;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	    
                  ) ; endlist
        (princ x fn)
        (write-line "" fn)
      ) ; end foreach
      (close fn)
      (setq acadfn nil)
      t ; return True
;    ) ; end progn
    nil ; return nil
;  ) ; endif
) ; end defun
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(defun C:РЕГИСТРИ (/ path plotname n true *error* JHSSHATCH dcl_id go)



;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; Правене на DCL файла ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(create_dclhelplispРЕГИСТРИ "helpРЕГИСТРИ")
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


 (defun *error* (x) (princ "\n*Cancel*"))

 (defun doButton(a)
  (cond
	((= a 34)(bExp))
	((= a 35)(pExp))
	((= a 36)(regV))
	((= a 37)(regH))
	((= a 38)(regC))
	((= a 39)(regS))
	((= a 40)(regS2))
	((= a 41)(back))
	((= a 42)(regHro))
	((= a 43)(regVro))
	((= a 44)(regCro))
	((= a 45)(cPExp))
  )
)



(defun bExp ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "bExp"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun pExp ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "pExp"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun regV ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "regV"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun regH ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "regH"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun regC ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "regC"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun regS ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "regS"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun regS2 ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "regS2"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun back ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "help"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun regHro ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "regHro"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun regVro ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "regVro"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun regCro ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "regCro"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)


(defun cPExp ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "cPExp"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)
#################################################################################
#################################################################################
#################################################################################
#################################################################################
#################################################################################
#################################################################################



  ;;;--- Load the dcl file
  (setq dcl_id (load_dialog "helpРЕГИСТРИ.dcl"))

  ;;;--- Load the dialog definition if it is not already loaded
  (if (not (new_dialog "helpРЕГИСТРИ" dcl_id) ) (exit))

  ;;;--- If an action event occurs, do this function
  (action_tile "bExp" "(doButton 34)(done_dialog)")
  (action_tile "pExp" "(doButton 35)(done_dialog)")
  (action_tile "regV" "(doButton 36)(done_dialog)")
  (action_tile "regH" "(doButton 37)(done_dialog)")
  (action_tile "regC" "(doButton 38)(done_dialog)")
  (action_tile "regS" "(doButton 39)(done_dialog)")
  (action_tile "regS2" "(doButton 40)(done_dialog)")
  (action_tile "back" "(doButton 41)(done_dialog)")
  (action_tile "regHro" "(doButton 42)(done_dialog)") 
  (action_tile "regVro" "(doButton 43)(done_dialog)")
  (action_tile "regCro" "(doButton 44)(done_dialog)")
  (action_tile "cPExp" "(doButton 45)(done_dialog)")
  ;;;--- Display the dialog box
  (start_dialog)

  ;;;--- Unload the dialog box
  (unload_dialog dcl_id)

  ;;;--- Suppress the last echo for a clean exit
  (princ)
)


####################################################################################################
##################################################################################################################################################################################################
###################################################################################################################################################################################################
###################################################################################################################################################################################################
###################################################################################################################################################################################################
###################################################################################################################################################################################################
###################################################################################################################################################################################################
###################################################################################################################################################################################################
###################################################################################################################################################################################################
###################################################################################################################################################################################################
###################################################################################################################################################################################################
###################################################################################################################################################################################################
###################################################################################################################################################################################################
###################################################################################################################################################################################################
###################################################################################################################################################################################################
###################################################################################################################################################################################################
###################################################################################################################################################################################################
###################################################################################################################################################################################################
##################################################################################################
##################################################################################################

#################################################################################################
##################################################################################################
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;  HELP Lisp     ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(defun create_dclhelplisp (fn / acadfn)
  (if (null (wcmatch (strcase fn) ".DCL"))
    (setq fn (strcat fn ".DCL"))
  )
;  (if (not (findfile fn))
    ;; create dcl file in same directory as ACAD.pat  
;    (progn
      (setq acadfn (findfile "ACAD.pat")
            fn (vl-string-subst fn "ACAD.pat" acadfn)
            fn (open fn "w")
      )
      (foreach x '(
	  
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	  
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	  
"help : dialog { "
"         label = \"                                              HELP LISP\"; "
""
"/////////////////////////////////////////////////////////////"
"///////////////////////// ETP 297 ///////////////////////////"
"/////////////////////////////////////////////////////////////"
"//////////// TEXT ////////////////// "
": column {"
"fixed_width=true;"
"    : row {"
"fixed_width = true;"
"alignment = Left;"
"      : text_part {"
"        label = \"            Команда   \";"
"fixed_width=true;"
"      }"
"}"
": row {"
"fixed_width = true;"
"alignment = right;"
"      : text_part {"
"        label = \"   натисни/напиши\";"
"fixed_width=true;"
"      }"
""
"}"
"}"

"/////////////////////////////////////////////////////////////"
"///////////////////////// команди ///////////////////////////"
"/////////////////////////////////////////////////////////////"
"//////////////////////// del3p.lsp //////////////////////////"
"///////////////////////////////////////////////////////////// "
"    : row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"d3\";"
"        label = \"   d3  \";"
"	is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Пускане на ординати в напречните профили.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////// a3.lsp //////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"a3\";"
"        label = \"   a3  \";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Изкарване на оградени площи в напречния профил в таблици.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////// km.lsp //////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"km\";"
"        label = \"   km  \";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Копира текста от txt/mtext/блок/атрибут и го пейства в друг txt/mtext/блок/атрибут\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"//////////////////// SLOPES.lsp /////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"slope\";"
"        label = \" slope\";"
"		is_default = false;"
"fixed_width=true;"
"}"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Правене на мустаци на откосите.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
"      }"
"    }"
""
"}"
""
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////   PageSetups CAB 07.LSP   ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"psu\";"
"        label = \"  psu  \";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Добавя Imported Page Setup на избрани или всички Layouts.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////   Layout-NameCH.lsp       ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
"fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"relay\";"
"        label = \"RElay \";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Преименува Layout-ите с номерация от 1 до N.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""

"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////   LayoutsTransfer.lsp       ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"Lsteal\";"
"        label = \"Lsteal\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Взимане на Layout-и от друг файл.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////   VPOutlineV1-3.lsp       ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"vpo\";"
"        label = \"VPOL\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Прехвърля очертанията на VP в Model-а. С командата VPOA го прави за всички VP едновременно.\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////          Otkosi.lsp       ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"otkos\";"
"        label = \"OTKOS\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Надписва наклона на откоса 1:n\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       naklon.lsp          ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"naklon\";"
"        label = \"NAKLON\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Надписва наклон в %\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       dimc                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"dimc\";"
"        label = \"dimc\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Създава стил дименсии за Напречни профили (ако няма), слага го текущ и прави дименсия (lineal)\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       dims                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"dims\";"
"        label = \"dims\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Създава стил дименсии за Ситуация (ако няма), слага го текущ и прави дименсия (aligned)\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       ttbelp                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"ttbhelp\";"
"        label = \"TitleBlock Help\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - отваря хелп файла, в който е обяснено всичко за TitleBlock-овете\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       QE                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"qe\";"
"        label = \"QE\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Променяте текста на TEXT, АТРИБУТИ и някои MTEXT в блокове без да влизате в тях\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       QEC                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"qec\";"
"        label = \"QEC\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Променяте цвета на TEXT, АТРИБУТИ и някои MTEXT в блокове без да влизате в тях\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       Ln                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"Ln\";"
"        label = \"Ln\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Чертаете и надписвате линия със зададен от вас наклон в %\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       Lо                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"Lо\";"
"        label = \"Lо\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Чертаете и надписвате откосна линия със зададен от вас наклон - 1:2 (Y:X)\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       addtoblock                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"addtoblock\";"
"        label = \"addtoblock\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Вкарва маркирани обекти в маркиран от вас блок\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       ndel                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"ndel\";"
"        label = \"ndel\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Трие обект от блок без да се налага да се влиза в него\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       ncut                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"ncut\";"
"        label = \"ncut\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - CUT-va обект от блок без да се налага да се влиза в него\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       nmove                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"nmove\";"
"        label = \"nmove\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Премества обекти в блокове и XREF без да се налага да влизате в тях. (Внимавайте защото прави save На xref дори да е отворен!)\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       label                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"label\";"
"        label = \"label\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Поставя написан от вас надпис по продължение на Line/Polyline/Curve \";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       DELBLOCKS                ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"delblocks\";"
"        label = \"delblocks\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Изтрива избран блок или блокове от файла\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       WW                  ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"ww\";"
"        label = \"ww\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Бързо отбелязване на точки от напречния профил в ситуация\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       calc                  ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"calc\";"
"        label = \"calc\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Събира/Изважда две числа (TEXT,MTEXT) и поставя резултата във друг TEXT/MTEXT\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       wf                  ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"wf\";"
"        label = \"wf\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Променя width factor на избран/и текстови обекти\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       wf                  ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"wfb\";"
"        label = \"wfb\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Променя width factor на текст, който се намира в блок\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
": row {"
"         label = \"======================================================================================================================================\"; "
"}"
": row {"
"         label = \"___________________________________________________________    За CIVIL 3D   _______________________________________________________________\"; "
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       slg                  ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"slg\";"
"        label = \"slg\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Правене на предварително зададени SampleLine Groups\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       s2p                  ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"s2p\";"
"        label = \"s2p\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Прави от маркирана SampleLine полилиния, като я вкарва във слоя на SampleLine\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////       s2f                  ///////////////////////"
"/////////////////////////////////////////////////////////////"
"///////////////////////////////////////////////////////////// "
": row {"
 "fixed_width = true;"
"alignment = left;"
"      : button {"
"width = 14;"
"fixed_width = true;"
"        key = \"s2f\";"
"        label = \"s2f\";"
"		is_default = false;"
"fixed_width=true;"
"      }"
": row {"
"fixed_width = true;"
"      : text_part {"
"        label = \"  - Прави Feature линии на всички SampleLines, или на маркирани. Имената и стиловете са предварително зададени във файла SampleLineGroups.csv\";"
"fixed_width_font=true;"
"fixed_width=true;"
"height = 1;"
"alignment = centered;"
""
"      }"
"    }"
""
"}"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"/////////////////////////////////////////////////////////////"
"           : boxed_row { "
"             : button {"
"               key = \"cancel\";"
"               label = \"Close\";"
"               is_default = true;"
"               is_cancel = true;"
"		alignment = centered;"
"             } "
"           } "
"      }"
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;			;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;	    
                  ) ; endlist
        (princ x fn)
        (write-line "" fn)
      ) ; end foreach
      (close fn)
      (setq acadfn nil)
      t ; return True
;    ) ; end progn
    nil ; return nil
;  ) ; endif
) ; end defun
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(defun helpp (/ path plotname n true *error* JHSSHATCH dcl_id go)



;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; Правене на DCL файла ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(create_dclhelplisp "help")
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


 (defun *error* (x) (princ "\n*Cancel*"))

 (defun doButton(a)
  (cond
    ((= a 1)(d3))
    ((= a 2)(a3))
    ((= a 3)(km))
    ((= a 4)(pps))
    ((= a 5)(slope))
	((= a 6)(relay))
	((= a 7)(psu))
	((= a 8)(relay))
	((= a 9)(Lsteal))
	((= a 10)(VPOL))
	((= a 11)(otkos))
	((= a 12)(naklon))
	((= a 13)(dimc))
	((= a 14)(dims))
	((= a 15)(ttbhelp))
	((= a 16)(qe))
	((= a 17)(qec))
	((= a 18)(Ln))
	((= a 19)(Lо))
	((= a 20)(addtoblock))
	((= a 21)(ndel))
	((= a 22)(ncut))
	((= a 23)(nmove))
	((= a 24)(label))
	((= a 25)(deblocks))
	((= a 26)(ww))
	((= a 27)(slg))
	((= a 28)(calc))
	((= a 29)(wf))
	((= a 30)(wfb))
	((= a 31)(s2p))
	((= a 32)(s2f))
  )
)

(defun d3 ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "d3"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun a3 ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "a3"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun km ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "km"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun pps ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "pps"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun slope ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "slope"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun psu ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "psu"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun relay ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "relay"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun Lsteal ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "LSteal"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun VPOL ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "vpol"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun otkos ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "otkos"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun naklon ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "naklon"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun dimc ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "dimc"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun dims ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "dims"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ttbhelp ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ttbhelp"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun qe ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "qe"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun qec ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "qec"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun Ln ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "Ln"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun Lо ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "LO"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun addtoblock ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "addtoblock"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ndel ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ndel"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ncut ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ncut"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun nmove ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "nmove"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun label ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "label"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun delblocks ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "delblocks"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun ww ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "ww"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun slg ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "slg"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun calc ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "calc"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun wf ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "wf"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun wfb ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "wfb"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)


(defun s2p ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "s2p"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)

(defun s2f ()
(vl-load-com)
(setq thisdrawing (vla-get-activedocument
(vlax-get-acad-object)))
(vla-SendCommand thisdrawing (strcat "s2f"))
(vla-SendCommand thisdrawing (strcat " "))
(princ)
)
#################################################################################
#################################################################################
#################################################################################
#################################################################################
#################################################################################
#################################################################################



  ;;;--- Load the dcl file
  (setq dcl_id (load_dialog "help.dcl"))

  ;;;--- Load the dialog definition if it is not already loaded
  (if (not (new_dialog "help" dcl_id) ) (exit))

  ;;;--- If an action event occurs, do this function
  (action_tile "d3" "(doButton 1)(done_dialog)")
  (action_tile "a3" "(doButton 2)(done_dialog)")
  (action_tile "km" "(doButton 3)(done_dialog)")
  (action_tile "pps" "(doButton 4)(done_dialog)")
  (action_tile "slope" "(doButton 5)(done_dialog)")
  (action_tile "relay" "(doButton 6)(done_dialog)")
  (action_tile "psu" "(doButton 7)(done_dialog)")
  (action_tile "relay" "(doButton 8)(done_dialog)")
  (action_tile "Lsteal" "(doButton 9)(done_dialog)")
  (action_tile "vpo" "(doButton 10)(done_dialog)")
  (action_tile "otkos" "(doButton 11)(done_dialog)")
  (action_tile "naklon" "(doButton 12)(done_dialog)")
  (action_tile "dimc" "(doButton 13)(done_dialog)")
  (action_tile "dims" "(doButton 14)(done_dialog)")
  (action_tile "ttbhelp" "(doButton 15)(done_dialog)")
  (action_tile "qe" "(doButton 16)(done_dialog)")
  (action_tile "qec" "(doButton 17)(done_dialog)")
  (action_tile "Ln" "(doButton 18)(done_dialog)")
  (action_tile "Lо" "(doButton 19)(done_dialog)")
  (action_tile "addtoblock" "(doButton 20)(done_dialog)")
  (action_tile "ndel" "(doButton 21)(done_dialog)")
  (action_tile "ncut" "(doButton 22)(done_dialog)")
  (action_tile "nmove" "(doButton 23)(done_dialog)")
  (action_tile "label" "(doButton 24)(done_dialog)")
  (action_tile "delblocks" "(doButton 25)(done_dialog)")
  (action_tile "ww" "(doButton 26)(done_dialog)")
  (action_tile "slg" "(doButton 27)(done_dialog)")
  (action_tile "calc" "(doButton 28)(done_dialog)")
  (action_tile "wf" "(doButton 29)(done_dialog)")
  (action_tile "wfb" "(doButton 30)(done_dialog)")
  (action_tile "s2p" "(doButton 31)(done_dialog)")
  (action_tile "s2f" "(doButton 32)(done_dialog)")
  ;;;--- Display the dialog box
  (start_dialog)

  ;;;--- Unload the dialog box
  (unload_dialog dcl_id)

  ;;;--- Suppress the last echo for a clean exit
  (princ)
)

